const List<Map<String, String>> allahNames = [
  {
    "id": "allah",
    "description":
        "قال الله تعالى: <specialFont>ﵟإِنَّنِيٓ أَنَا ٱللَّهُ لَآ إِلَٰهَ إِلَّآ أَنَا۠ﵞ</specialFont> (طه: ١٤)، لفظ الجلالة، وأشهر أسماء الله جلَّ في عُلاه، ويعني: الإله الحق لجميع المخلوقات، ولا معبود بحق إلا هو، ويجمع في معناه جميع الصفات والأسماء الحسنى، ويعتبر هذا الاسم الأعم والأشمل لله، إذ أنه يختص بالخالق وحده، ولا يجوز إطلاقه على غيره، وفي الحديث الشريف: «إن لله تسعة وتسعين اسمًا، مئة إلا واحدًا، من أحصاها دخل الجنة» (البخاري: ٢٧٣٦)، والاسمُ مشتقٌّ من الجذر الثلاثي (أَلَهَ) الذي يعني التعبُّد والتأليه، يقال: (أَلِهَ) إليه إذا تَعبَّد وتوجَّه إليه، وقيل: إنه اسم غير مشتق، خاص بالله وحده، وقيل: إنه مأخوذ من (الإله) بمعنى المعبود، الذي يستحق العبادة."
  },
  {
    "id": "ar-rahman",
    "description":
        "قال الله تعالى: <specialFont>ﵟٱلرَّحۡمَٰنُ عَلَى ٱلۡعَرۡشِ ٱسۡتَوَىٰﵞ</specialFont> (طه: ٥)، وقال تعالى: <specialFont>ﵟ قُلِ ٱدۡعُواْ ٱللَّهَ أَوِ ٱدۡعُواْ ٱلرَّحۡمَٰنَۖﵞ</specialFont> (الإسراء: ١١٠)، وفي الحديثِ الشريف: «الرَّاحمون يرحمهُمُ الرحمن» (الترمذي: ١٩٢٤). معناه: ذو الرحمة التي لا غاية بعدها في الرحمة، والذي وسعت رحمته كل شيء، شملت جميع المخلوقات في الدنيا والآخرة، والكلمة مأخوذة من الجذر الثلاثي: (رَحِمَ)، ويدل على الرأفة، والشفقة، والرحمة، والرحمن على وزن (فعلان)، وهو صيغة مبالغة تفيد الامتلاء والزيادة، ما يعني أن رحمة الله لا حدَّ لها، وهي شاملة لكل المخلوقات."
  },
  {
    "id": "ar-raheem",
    "description":
        "قال الله تعالى: <specialFont>ﵟ ٱلرَّحۡمَٰنِ ٱلرَّحِيمِﵞ</specialFont> (الفاتحة: ٣)، وقال: <specialFont>ﵟإِنَّ ٱللَّهَ بِٱلنَّاسِ لَرَءُوفٞ رَّحِيمٞﵞ</specialFont> (البقرة: ١٤٣)، وقال: <specialFont>ﵟوَكَانَ بِٱلۡمُؤۡمِنِينَ رَحِيمٗاﵞ</specialFont> (الأحزاب: ٤٣)، ومعنى (الرَّحيمُ): الرفيق بالمؤمنين والعاطف على خلقه بالرزق، ويدل على رحمة الله الخاصة بالمؤمنين، فرحمة (الرحيم) تأتي للمؤمنين في الدنيا والآخرة، من خلال المغفرة، والعفو، والهداية، والجنة، ويمثل هذا الاسم العلاقة التي تجمع بين الله وعباده المؤمنين، و(الرحيم) مشتق من الجذر الثلاثي: (رَحِمَ)، على وزن (فعيل)، ويدل على صفة ثابتة ودائمة، ما يعني أن الله دائم الرحمة لعباده."
  },
  {
    "id": "al-maalik",
    "description":
        "قال تعالى: <specialFont>ﵟ فَتَعَٰلَى ٱللَّهُ ٱلۡمَلِكُ ٱلۡحَقُّۖ ﵞ</specialFont> (المؤمنون: ١١٦)، وفي السنة النبوية: «يَقْبِضُ اللَّهُ الأرْضَ، ويَطْوِي السَّمَواتِ بيَمِينِهِ، ثُمَّ يقولُ: أنا المَلِكُ، أيْنَ مُلُوكُ الأرْضِ؟» (البخاري: ٤٨١٢)، و(المَلِكُ) هو الله، تعالى وتقدَّس، مَلِكُ المُلُوك له المُلْكُ وهو مَالِك يوم الدين وهو مَلِيكُ الخلق أي ربهم ومالكهم، وهي من الأسماء التي تدل على ملكية الله المطلقة، والسيادة الكاملة على كل شيء في الوجود، فالله هو الملك الحقيقي لكل ما في السماوات والأرض وما بينهما، وهو الذي يملك أمر الخلق، وهو المتصرف فيهم بأمره وحكمه دون شريك أو منازع، والمَلِكُ: من الجذر الثلاثي (مَلَكَ) الذي يعني الحيازة، والسيطرة، والقدرة، والتصرف، والمَلِك هو صاحب السلطة الكاملة والسيادة المطلقة، أما في حق الله تعالى، فإن ملكه يتجاوز الملك البشري، إذ أنه ملك حقيقي دائم لا يتأثر بزوال أو نقص."
  },
  {
    "id": "al-quddus",
    "description":
        "قال الله تعالى: <specialFont>ﵟ يُسَبِّحُ لِلَّهِ مَا فِي ٱلسَّمَٰوَٰتِ وَمَا فِي ٱلۡأَرۡضِ ٱلۡمَلِكِ ٱلۡقُدُّوسِﵞ</specialFont> (الجمعة: ١)، وفي السنة النبوية: «سُبُّوحٌ قُدُّوسٌ، رَبُّ المَلَائِكَةِ والرُّوحِ» (مسلم: ٤٨٧)، والقُدُّوس: مأخوذ من الجذر (قدس) يدل على الطهارة والتنزيه، تقدَّس: أي تنزَّه عن العيوب والنواقص، والقدوس صيغة مبالغة تفيد الكمال في الطهارة والتنزيه عن كل ما لا يليق، ويدل الاسم على أن الله سبحانه وتعالى منزه عن كل نقص أو عيب، وهو الكامل في صفاته وأفعاله، وهو الطاهر والمطهر عن أي شائبة، والمقدس الذي يستحق التعظيم والتبجيل."
  },
  {
    "id": "as-salaam",
    "description":
        "قال تعالى: <specialFont>ﵟ هُوَ ٱللَّهُ ٱلَّذِي لَآ إِلَٰهَ إِلَّا هُوَ ٱلۡمَلِكُ ٱلۡقُدُّوسُ ٱلسَّلَٰمُﵞ</specialFont> (الحشر: ٢٣)، وفي الحديث الشريف: «إنَّ السلامَ اسمٌ من أسماءِ اللهِ تعالى وُضِعَ في الأرضِ، فأَفْشوا السَّلامَ بينكم» (صحيح الجامع: ١٦٣٩)، والسلام مأخوذ من الجذر (سَلِمَ)، والذي يدل على السلامة والأمان، يُقال: (سَلِمَ) أي نجا من العيوب والنواقص، والسلام: يعني الذي لا يتأثر بأي نقص أو ضرر، وهو الذي يمنح السلام والأمن، ويعني أن الله سبحانه وتعالى هو مصدر السلام والأمان، وهو الذي ينشر السلام في الكون ويمنح عباده الأمن والطمأنينة. كما أن (السلام) يعني أن الله منزه عن كل نقص أو عيب، فهو الكامل في ذاته وأفعاله وصفاته، وهو الذي يبعث السلام في القلوب ويحقق السلام في الآخرة لعباده المؤمنين."
  },
  {
    "id": "al-mumin",
    "description":
        "قال تعالى: <specialFont>ﵟهُوَ ٱللَّهُ ٱلَّذِي لَآ إِلَٰهَ إِلَّا هُوَ ٱلۡمَلِكُ ٱلۡقُدُّوسُ ٱلسَّلَٰمُ ٱلۡمُؤۡمِنُﵞ</specialFont> (الحشر: ٢٣)، والمؤمن مأخوذ من الجذر (أمن)، والذي يعني الأمان والطمأنينة، ويشير إلى أن الله سبحانه وتعالى هو الذي يهب الأمان لعباده، ويصدق وعده لهم، ويؤمنهم من الخوف."
  },
  {
    "id": "al-muhaymin",
    "description":
        "قال تعالى: <specialFont>ﵟ هُوَ ٱللَّهُ ٱلَّذِي لَآ إِلَٰهَ إِلَّا هُوَ ٱلۡمَلِكُ ٱلۡقُدُّوسُ ٱلسَّلَٰمُ ٱلۡمُؤۡمِنُ ٱلۡمُهَيۡمِنُﵞ</specialFont> (الحشر: ٢٣)، (المهيمن) مأخوذ من الجذر (هيمن)، ويعني الرقابة والإشراف الكامل، يُقال: (هيمن على الشيء) أي: راقبه، وسيطر عليه بحفظ وإحاطة، يعني أن الله سبحانه وتعالى هو الرقيب والحافظ والمسيطر على كل شيء، وهو الذي يشرف ويراقب كل ما يجري في الكون بحكمة وعدل، ويشير إلى سيطرة الله التامة على جميع مخلوقاته، وأنه الشاهد على أعمالهم، ولا يخفى عليه شيء."
  },
  {
    "id": "al-aziz",
    "description":
        "قوله تعالى: <specialFont>ﵟوَهُوَ ٱلۡعَزِيزُ ٱلۡحَكِيمُﵞ</specialFont> (الحشر: ٢٤)، والعزيز، مأخوذ من الجذر (عزَّ)، ويعني القوة والشدة والمنعة. يُقال: (عزَّ)، بمعنى قوي واشتد، و(عزيز) أي: منيع لا يُغلب، والعزيزُ: الله الذي لا يُغلب، وهو القوي القادر الذي لا يُنال ولا يُدرك. يجمع بين القوة والكرامة والمنعة، فلا مثيل له في عزته، وهو الغالب الذي لا يغلبه أحد، ولا يُمكن أن يصل إليه نقص أو ضعف، سبحانه الغالب على أمره، والمُعز لمن يشاء من خلقه، والمتفرد بالقدرة والعظمة."
  },
  {
    "id": "al-jabbar",
    "description":
        "قوله تعالى: <specialFont>ﵟهُوَ ٱللَّهُ ٱلَّذِي لَآ إِلَٰهَ إِلَّا هُوَ ٱلۡمَلِكُ ٱلۡقُدُّوسُ ٱلسَّلَٰمُ ٱلۡمُؤۡمِنُ ٱلۡمُهَيۡمِنُ ٱلۡعَزِيزُ ٱلۡجَبَّارُ ٱلۡمُتَكَبِّرُۚ ﵞ</specialFont> (الحشر: ٢٣)، وفي الحديث الشريف: «تَكُونُ الأرْضُ يَومَ القِيامَةِ خُبْزَةً واحِدَةً، يَتَكَفَّؤُها الجَبَّارُ بيَدِهِ» (البخاري: ٦٥٢٠)، ومعنى الجبَّار: الذي يقهر الجبابرة، ويصلح أحوال خلقه برحمته وقوته، وهو الذي لا يُقهر ولا يُغلب، ويفرض إرادته فوق كل شيء، وهو الذي يجبر الكسير، ويصلح الأحوال بالرحمة واللطف، والكلمة مأخوذة من الجذر الثلاثي: (جبر)، ويدل على القوة والقهر والإصلاح. يُقال: (جبر العظم) أي أصلحه بعد كسره، و(الجبار) يعني القوي الذي لا يُغلب والذي يُصلح بحكمته ما فسد، ويشيرُ إلى قوة الله وسلطانه الذي لا يُقهر، وهو الذي يُصلح الأحوال ويجبر القلوب المكسورة برحمته، فهو المتفرد بالعظمة، الذي يُعيد الحق لأصحابه ويقهر الظالمين، ويعطي الرحمة لعباده المستضعفين."
  },
  {
    "id": "al-mutakabbir",
    "description":
        "قوله تعالى: <specialFont>ﵟهُوَ ٱللَّهُ ٱلَّذِي لَآ إِلَٰهَ إِلَّا هُوَ ٱلۡمَلِكُ ٱلۡقُدُّوسُ ٱلسَّلَٰمُ ٱلۡمُؤۡمِنُ ٱلۡمُهَيۡمِنُ ٱلۡعَزِيزُ ٱلۡجَبَّارُ ٱلۡمُتَكَبِّرُۚﵞ</specialFont> (الحشر: ٢٣)، و(المتكبر): المتفرد بالعظمة والكبرياء، الذي يتعالى عن صفات المخلوقين، ولا يشاركه في الكبرياء أحد، والكلمة مأخوذة من الجذر الثلاثي: (كَبُرَ)، والذي يدل على التعالي والعظمة، وهو الذي يترفع عن الظلم ولا يظلم أحدًا، وله الكبرياء في السماوات والأرض، و(المتكبر) على وزن (مُتفَعِّل)، صيغة تدل على العظمة والرفعة، ويعني أن الله سبحانه وتعالى يتعالى عن صفات الخلق، فهو المنزه عن كل نقص أو عيب، ولا يمكن لأحد أن يقترب من كبريائه، كبرياؤه مطلق ولا يُشاركه فيه أحد."
  },
  {
    "id": "al-khaliq",
    "description":
        "قوله تعالى: <specialFont>ﵟهُوَ ٱللَّهُ ٱلۡخَٰلِقُﵞ</specialFont> (الحشر: ٢٤)، والخالق: مأخوذ من الجذر (خلق)، ويعني الإبداع والتقدير، يُقال: (خلق الشيء) أي أوجده، وأبدعه على غير مثال سابق، والخالق في اللغة هو الذي يُبدع ويُقدِّر ويُصوِّر الأشياء بحكمة وإتقان، ويشير اسم الخالق إلى الله سبحانه وتعالى الذي يبدع ويخلق الكون وكل ما فيه من العدم، فالله الخالق هو الذي أنشأ جميع الكائنات والمخلوقات وفق نظام محكم وحكمة بالغة، ودلالة اسم (الخالق) تعني أن الله هو المبدع والمصور، الذي يتفرد بخلق كل شيء من العدم وتقدير الأشياء بإحكام، وهو الذي خلق الإنسان وسائر المخلوقات وفق حكمته وعلمه الواسع، ولا يُشبهه شيء في خلقه."
  },
  {
    "id": "al-bari",
    "description":
        "قال الله تعالى: <specialFont>ﵟهُوَ ٱللَّهُ ٱلۡخَٰلِقُ ٱلۡبَارِئُﵞ</specialFont> (الحشر: ٢٤)، ومعنى (البارئ): الله الذي يُبرئ الخلق، أي يُخرجهم من العدم إلى الوجود بشكل متقن ومنظم، ويعني الإبداع والإصلاح، والكلمة مأخوذة من الجذر الثلاثي: (بَرَأَ)، والذي يدل على الإبداع والتكوين، والله (البارئ): هو الذي يُخرج الخلق من العدم ويخلقهم ويُنظمهم بإتقان وعظمة، ويعكس قدرته على الإبداع والتنظيم، وهو على وزن (فَاعِل)، صيغة تدل على القدرة والإتقان، ويعني أن الله سبحانه وتعالى هو الذي يبدع ويخلق كل ما نراه وما لا نراه، ويقوم بترتيب وتنظيم الخلق بشكل دقيق ومميز."
  },
  {
    "id": "al-musawwir",
    "description":
        "قال الله تعالى: <specialFont>ﵟهُوَ ٱللَّهُ ٱلۡخَٰلِقُ ٱلۡبَارِئُ ٱلۡمُصَوِّرُۖﵞ</specialFont>  (الحشر: ٢٤)، كلمة (المصور) مأخوذة من الجذر (صوَّر)، وتعني إعطاء الشيء شكله الخارجي وهيئته الخاصة، وهي الهيئة التي يُميز بها الشيء عن غيره، و(المصور): الذي يُبدع في خلق الصور، والهيئات، ويدل الاسم على قدرة الله سبحانه وتعالى في إعطاء كل مخلوق صورته الخاصة وهيئته المميزة، فاللهُ هو الذي يُصوِّر كل شيء في أحسن صورة، سواء كانت صور المخلوقات في أجسامها، أو أرواحها، أو أجزائها، وهو الذي يُبدع في تصوير كل مخلوق بالشكل الذي يناسبه."
  },
  {
    "id": "al-ghaffar",
    "description":
        "قوله تعالى: <specialFont>ﵟوَإِنِّي لَغَفَّارٞ لِّمَن تَابَﵞ</specialFont> (طه: ٨٢)، كلمة (الغفار) مأخوذة من الجذر (غفر)، والذي يعني الستر والتغطية، يُقال: (غفر الله ذنبه)، أي ستره وتجاوز عنه، و(الغفار) صيغة مبالغة تدل على كثرة وغزارة المغفرة، و(الغفار) من أسماء الله الدالة على كثرة مغفرة الله سبحانه وتعالى لعباده، وستر الذنوب والمعاصي، فالله هو الذي يغفر الذنوب مهما عظمت، ويتجاوز عن الخطايا بفضله ورحمته، ويَتَّصِفُ اللهُ سبحانه وتعالى بالمغفرة الواسعة التي تشمل جميع الذنوب إذا تاب العبد واستغفر، ويدل الاسم على أن الله سبحانه وتعالى كثير المغفرة، وأنه يغفر الذنوب مهما كانت كثيرة أو عظيمة إذا لجأ العبد إليه بالتوبة، يستر الذنوب ولا يفضح عباده، ويغفر لهم برحمته وفضله، ولا يمل من المغفرة مهما تكرر الذنب."
  },
  {
    "id": "al-qahhaar",
    "description":
        "قال تعالى: <specialFont>ﵟوَهُوَ ٱلۡقَاهِرُ فَوۡقَ عِبَادِهِۦۚﵞ</specialFont> (الأنعام: ١٨)، و(القهار) مأخوذ من الجذر (قهر)، والذي يعني الغلبة والتسلط والقوة، يُقال: (قهرهُ) أي: غلبه وأخضعه، و(القهَّارُ) صيغة مبالغة تدل على القوة العظيمة والغلبة التي لا تُقاوَم، ويشير إلى قدرة الله سبحانه وتعالى المطلقة في قهر كل شيء وغلبته، فالله هو الذي يقهر الجبابرة ويذل المتكبرين، ويسيطر على كل شيء بقوته وعظمته، ولا يعجزه شيء في الأرض ولا في السماء، ويدل اسم (القهار) على أن الله سبحانه وتعالى له الغلبة المطلقة على كل مخلوقاته، ولا يعجزه ولا يخرج شيء عن إرادته، وهو الذي يقهر الجبابرة والمستكبرين، ويُخْضِعهم لمشيئته، ويظهر ضعف المخلوقات أمام قوته؛ كما أنه القادر على تغيير الأحوال، وغلبة الأعداء."
  },
  {
    "id": "al-wahhab",
    "description":
        "قوله تعالى: <specialFont>ﵟإِنَّكَ أَنتَ ٱلۡوَهَّابُﵞ</specialFont> (آل عمران: ٨)، والوهاب: مأخوذ من الجذر (وهب) الذي يعني العطاء دون مقابل، يُقال: (وهب له)، أي: أعطاه شيئًا تفضلاً بلا مقابل، والوهَّاب: صيغة مبالغة تدل على الكثرة في العطاء والسخاء، ويشير إلى أن الله سبحانه وتعالى يعطي عطايا وهبات عظيمة بلا مقابل، وهو الذي يرزق من يشاء من فضله وكرمه بدون حساب، وهو الوَّهاب يهب نعمه على عباده بغير طلب أو استحقاق، فهو المُعطي بلا منَّة ولا حدود، ويَدُلُّ على الكرم الإلهي الذي لا ينقطع، يعطي بلا حساب ولا يُسأل عما يعطيه، وهو الوهَّاب يهب نعمه العظيمة، سواء كانت مادية أو معنوية، مثل: الهداية، الرزق، النصر، والمغفرة، يمنح الخير لعباده بلا مقابل، ولا يستحق أحد هباته، بل هي فضل منه."
  },
  {
    "id": "ar-razzaq",
    "description":
        "قوله تعالى: <specialFont>ﵟإِنَّ ٱللَّهَ هُوَ ٱلرَّزَّاقُ ذُو ٱلۡقُوَّةِ ٱلۡمَتِينُﵞ</specialFont> (الذاريات: ٥٨)، والرزَّاق: مأخوذ من الجذر (رَزَقَ)، صيغة مبالغة تشير إلى كثرة العطاء واستمراره، ما يعني أن الله سبحانه وتعالى هو الذي يُعطي الأرزاق بكرم وسخاء لا ينقطع، ويعني أن الله سبحانه وتعالى هو الذي يرزق جميع مخلوقاته رزقًا واسعًا دائمًا، وهو الذي يُقسم الأرزاق بحكمته ورحمته، والرزق ليس الرزق المادي كالطعام والمال فقط، بل يشمل الرزق المعنوي كالطاقة، والصحة، والعلم، والهداية، وهو الذي يوزع الأرزاق بحكمة، ولا ينسى أحدًا من عباده مهما كان ضعيفًا أو فقيرًا، ورزق الله مستمر وعطاؤه دائم، ويشمل كل مخلوقاته."
  },
  {
    "id": "al-fattah",
    "description":
        "قوله تعالى: <specialFont>ﵟوَهُوَ ٱلۡفَتَّاحُ ٱلۡعَلِيمُﵞ</specialFont> (سبأ، ٢٦)، يدل اسم (الفتَّاح) على أن الله سبحانه هو الذي يفتح كل مغلق، وييسر كل عسير، وهو من الفعل (فتح) والذي يدل على الكشف عن المغلقات والله الفتَّاح، يعني: يفتح أبواب الرحمة والرزق لعباده، ويفتح قلوبهم للإيمان والعلم، ويفصل بينهم بالحق والعدل، «والفتاح: الذي يحكم بين عباده، بأحكامه الشرعية، وأحكامه القدرية، وأحكام الجزاء، الذي فتح بلطفه بصائر الصادقين، وفتح قلوبهم لمعرفته، محبته، والإنابة إليه، وفتح لعباده أبواب الرحمة والأرزاق المتنوعة، وسبب لهم الأسباب التي ينالون بها خير الدنيا والآخرة. (تفسير أسماء الله الحسنى)، للسعدي (٢٢٠)."
  },
  {
    "id": "al-aleem",
    "description":
        "قوله تعالى: <specialFont>ﵟسُبۡحَٰنَكَ لَا عِلۡمَ لَنَآ إِلَّا مَا عَلَّمۡتَنَآۖ إِنَّكَ أَنتَ ٱلۡعَلِيمُ ٱلۡحَكِيمُﵞ</specialFont> (البقرة: ٣٢) وقد ورد الاسم في آيات كثيرة في القرآن، والعليمُ يعني: الذي أحاط علمه بكل شيء، فلا يخفى عليه شيء في الأرض ولا في السماء، يعلم السر والجهر، والماضي والحاضر والمستقبل، وهو مشتقٌّ من الجذر الثلاثي (عَلِمَ) الذي يعني المعرفة والإدراك، عَلِمَ الشيءَ، أي: أدركه وفهمه فهمًا تامًّا، قال تعالى: ﴿وهُوَ بِكُلِّ شَيْءٍ عَلِيمٌ﴾ (البقرة: ٢٩، الأنعام: ١٠١، الحديد: ٣)، والعليم: هو الذي أحاط علمه بالظواهر، والبواطن، والإسرار، والإعلان، والواجبات، والمستحيلات، والممكنات. وبالعالم العلوي والسفلي، وبالماضي، والحاضر، والمستقبل، فلا يخفى عليه شيء من الأشياء، وهو العليم المحيط علمه بكل شيء: بالواجبات، والممتنعات، والممكنات، فيعلم تعالى نفسه الكريمة، ونعوته المقدسة، وأوصافه العظيمة، وهي الواجبات التي لا يمكن إلا وجودها، ويعلم الممتنعات حال امتناعها، ويعلم ما يترتب على وجودها لو وجدت. (شرح أسماء الله الحسنى للسعدي: ١٩٤)."
  },
  {
    "id": "al-qabid",
    "description":
        "قوله تعالى: <specialFont>ﵟوَٱللَّهُ يَقۡبِضُ وَيَبۡصُۜطُﵞ</specialFont> (البقرة: ٢٤٥)، وفي الحديث الشريف: «إنَّ الله هو المُسعِّرُ، القابضُ، الباسطُ، الرزَّاقُ» (أبو داود: ٣٤٥١)، والقابضُ مأخوذ من الجذر (قبض)، ويعني الأخذ والتقليل، (قبض الشيء) أي: أمسكه وضيق عليه، و(القابض): هو الله الذي يمسك الرزق أو الحياة بيده، ويقدر على تقليلها أو إنهائها وفق مشيئته، ويعني الله سبحانه وتعالى الذي يقبض الرزق والنعم والروح بحكمته وعدله، وهو الذي يضيق على من يشاء في رزقه، ويقبض نفوس الخلق عند انتهاء أجلهم، وكل ذلك لحكمة يعلمها، و(القابض) يدل على أن الله يملك التصرف في الأمور كلها، فيقبض ويقدر ما شاء وفق حكمته."
  },
  {
    "id": "al-basit",
    "description":
        "مأخوذ من الجذر (بسط)، ويعني التوسيع، بسط الشَّيءُ: أي نشره ووسعه، والباسطُ: هو الذي يَبْسُطُ الرزق لعباده ويوسِّعه عليهم بجُوده ورحمته ويبسُط الأَرواح في الأَجساد عند الحياة، ويمد عباده بالنعم، والخير والرزق، وييسر الأمور، ويمنح الفضل لمن يشاء من عباده، ويدل الاسم على سخاء الله غير المحدود، ورحمته التي تشمل كل شيء."
  },
  {
    "id": "al-khafid",
    "description":
        "الخَفْضُ ضِدُّ الرفْع، مأخوذٌ من الجذر (خفض)، ويعني الإنزال أو التقليل، و(خفض الشيء): أي أنزله وجعله أقل، والخافِضُ: الذي يَخْفِضُ الجبّارِينَ والفراعنة أَي يضَعُهم ويُهِينُهم ويخفض كل شيءٍ يريد خَفْضَه، واسم (الخافض) يدل على قدرة الله في إذلال المتكبرين والطغاة، وإنزالهم من مراتبهم العالية التي وصلوا إليها بالظلم والعدوان، يخفض من يشاء بحكمته وعدله، وينظم الأمور في الكون فيضع من استحق الخفض بسبب طغيانه وجبروته."
  },
  {
    "id": "ar-rafi",
    "description":
        "في القرآن: <specialFont>ﵟيَرۡفَعِ ٱللَّهُ ٱلَّذِينَ ءَامَنُواْ مِنكُمۡ وَٱلَّذِينَ أُوتُواْ ٱلۡعِلۡمَ دَرَجَٰتٖۚﵞ</specialFont> (المجادلة: ١١)، وفي الحديث: «إنَّ اللَّهَ يَرْفَعُ بهذا الكِتَابِ أَقْوَامًا، وَيَضَعُ به آخَرِينَ» (مسلم: ٨١٧)، وفي أَسْماء الله تعالى الرافِعُ هو الذي يَرْفَعُ المؤْمن بالإِسعاد وأَولياءَه بالتقْرِيب، والرافع مأخوذ من الجذر (رفع)، ويعني الإعلاء، يُقال: رفع الشيء، أي: جعله أعلى. والرافع: الذي يرفع الأشخاص، أو الأشياء إلى مكانة أو مستوى أعلى وفق حكمته وعدله، ويدل على قدرة الله في رفع شأن من يشاء من عباده، سواء في الدنيا من خلال رفعة المكانة والقدر، أو في الآخرة برفع درجات المؤمنين في الجنة، فالله يرفع من يشاء بطاعته وتقواه، ويعلي من يستحق الرفعة بعمله الصالح وصبره."
  },
  {
    "id": "al-muizz",
    "description":
        "اسم (المعز) مأخوذ من الجذر (عزَّ) ويعني القوة والشرف، ويشير إلى أن الله سبحانه وتعالى هو الذي يمنح العزة والمكانة الرفيعة لمن يشاء من عباده في الدنيا والآخرة، والله يرفع شأن المؤمنين بطاعتهم له ويمنحهم العزة والنصر، كما ورد في القرآن في قوله تعالى: <specialFont>ﵟوَتُعِزُّ مَن تَشَآءُ وَتُذِلُّ مَن تَشَآءُۖﵞ</specialFont> (آل عمران: ٢٦)، مما يوضح أن العزة الحقيقية تأتي من الله وحده وهي مبنية على الإيمان والتقوى."
  },
  {
    "id": "al-mudhill",
    "description":
        "المُذِلُّ اسم يعبر عن قدرة الله المطلقة على إذلال الطغاة والجبابرة، ويُظهر أن العزة والذل بيد الله وحده، كما في قوله تعالى: <specialFont>ﵟوَتُعِزُّ مَن تَشَآءُ وَتُذِلُّ مَن تَشَآءُۖﵞ</specialFont> (آل عمران: ٢٦)، وهو يعزز تواضع المؤمنين ويجعلهم يدركون أن القوة ليست في أيديهم، بل هي نعمة من الله، مما يدفعهم للتواضع والاستغفار، ويشجعهم على عدم الكبر والتفاخر، مؤكدًا أن الله هو القادر على تغيير الأحوال، وأن الظالمين سيلاقون جزاءهم في الدنيا والآخرة."
  },
  {
    "id": "as-samee",
    "description":
        "اسم يُعبِّر عن صفة الله المطلقة في سماع كل الأصوات والأقوال، سواء كانت ظاهرة أو خفية، قال تعالى: <specialFont>ﵟإِنَّ ٱللَّهَ كَانَ سَمِيعَۢا بَصِيرٗاﵞ</specialFont> (النساء: ٥٨)، ويشمل سمع الله كل ما يُقال في السر والعلن، وهو وحده يستجيب دعاء عباده، ويعلم ما في قلوبهم، وفي الاسم دعوة للمؤمنين إلى الإخلاص في الدعاء والتوجه إلى الله دوما، إذ لا شيء يخفى عليه، وهو سميع لكل من ناداه، مجيب لمن دعاه."
  },
  {
    "id": "al-baseer",
    "description":
        "قال تعالى: <specialFont>ﵟوَهُوَ ٱلسَّمِيعُ ٱلۡبَصِيرُﵞ</specialFont> (الشورى: ١١)، والبصيرُ من الجذر (بصر)، ويعني قدرة الله على رؤية كل شيء، سواء أكان ظاهرًا أم خفيًا، وهو -جلَّ في عُلاه- بصيرٌ لأعمال الخلق، لا يخفى عليه شيءٌ منها، محيط بكل ما يجري في الكون، لا يغيب عنه شيء مهما دق أو صغر، وهو الشاهد على كل ما يحدث، مما يُظهر عظمة علمه وسعة قدرته."
  },
  {
    "id": "al-hakam",
    "description":
        "في القرآن الكريم: <specialFont>ﵟفَٱصۡبِرُواْ حَتَّىٰ يَحۡكُمَ ٱللَّهُ بَيۡنَنَاۚ وَهُوَ خَيۡرُ ٱلۡحَٰكِمِينَﵞ</specialFont> (الأعراف: ٨٧)، وفي الحديث الشريف: «إنَّ اللهَ هو الحَكَمُ وإليه الحُكْمُ» (صحيح ابن حبان: ٥٠٤)، من الجذر (حكم)، ويعني: القضاء والفصل بين الأمور، ويعني أن الله سبحانه وتعالى هو القاضي العادل الذي يفصل ويقضي بين عباده بالحق والعدل، وهو الحكم الذي لا يظلم أحدًا، وحكمه مطلق وكامل لا يعتريه خطأ أو نقص، ويدل على أن حكمه شامل لجميع الأمور، ولا يحتاج إلى وسيط أو مراجعة."
  },
  {
    "id": "al-adl",
    "description":
        "مأخوذ من الجذر (عدل)، ويعني الاستقامة والمساواة بين الأطراف، ويُقال: (عدل في الحكم)، أي: قضى بالإنصاف والتوازن، والعَدْلُ: هو الله الذي لا يميل ولا يظلم، بل يحكم بالإنصاف، ويعطي كل ذي حق حقه، ويحاسب الخلق على أعمالهم بالعدل المطلق، وفق أعمالهم وجزائهم العادل."
  },
  {
    "id": "al-lateef",
    "description":
        "قوله تعالى: <specialFont>ﵟوَهُوَ ٱللَّطِيفُ ٱلۡخَبِيرُ ﵞ</specialFont> (الأنعام: ١٠٣)، من الجذر (لطف)، ويعني: أن الله سبحانه وتعالى متصف بالرفق والرقة في أفعاله وتدبيره، ويعلم دقائق الأمور وخفاياها، يلطف بعباده، إذ يعلم أدق تفاصيل أحوالهم، فييسر لهم أمورهم ويصلحها، ويُحسن إليهم بلطفه ورحمته بطرق قد لا يدركها البشر."
  },
  {
    "id": "al-khabeer",
    "description":
        "قوله تعالى: <specialFont>ﵟأَلَا يَعۡلَمُ مَنۡ خَلَقَ وَهُوَ ٱللَّطِيفُ ٱلۡخَبِيرُ ﵞ</specialFont> (الملك: ١٤)، وقد ورد الاسم في آيات عديدة، وهو من الجذر (خبر)، ويعني العلم والدراية الدقيقة، والخبيرُ: الذي يعلم الأشياء بدقة وتفصيل تام، ويحيط بها من جميع جوانبها، وهو اللهُ الذي أحاط علمه بالأسرار، ومكنونات الصدور، ومغيبات الأمور، وما لطف ودقَّ من كل شيء، وعلمه دقيق ومفصل، ولا يخفى عليه شيء في الأرض ولا في السماء."
  },
  {
    "id": "al-haleem",
    "description":
        "الحليمُ، من الجذر (حلم)، ويعني الصبر والتأني، وعدم الاستعجال في الرد على الأفعال، حَلُمَ عنهُ أي: صَبُرَ عليهِ، والحليمُ: الذي يتصف بالصبر والصفح، ويدل على أن الله سبحانه وتعالى يصبر على عباده المذنبين ولا يعاجلهم بالعقوبة، بل يمهلهم ليتوبوا ويعودوا إليه، يغفر للمخطئين ويرحمهم، يمنح الفرصة تلو الفرصة للرجوع إليه، دون أن يغضب أو يعجل بالعقاب، وحلمه يشمل جميع خلقه، ويعبر عن صبره على إساءاتهم، في القرآن: <specialFont>ﵟوَٱللَّهُ غَفُورٌ حَلِيمٞﵞ</specialFont> (البقرة: ٢٢٥)."
  },
  {
    "id": "al-azeem",
    "description":
        "في آية الكرسي في القرآن الكريم، <specialFont>ﵟوَهُوَ ٱلۡعَلِيُّ ٱلۡعَظِيمُﵞ</specialFont> (البقرة: ٢٥٥)، من الجذر (عظم)، ويعني الضخامة والكبرياء، والعظيمُ: من يتصف بالكمال والجلال، والذي يتجاوز في عظمته كل ما يتخيله البشر، ويدل على أن الله سبحانه وتعالى له كل معاني العظمة والكمال والجلال، في ذاته وصفاته وأفعاله، لا يماثله شيء في عظمته، فهو المتفرد بالكمال المطلق، والذي لا تتناهى قدرته، ولا تحيط به الأفهام."
  },
  {
    "id": "al-ghafoor",
    "description":
        "من الجذر، (غفر)، ويعني الستر، يقال: غفر الشيء، أي ستره وأخفاه، والغفور صيغة مبالغة، تشير إلى كثرة المغفرة وعظم قدرة الله على ستر الذنوب والصفح عنها، ويدل على أن الله سبحانه وتعالى واسع المغفرة، يغفر الذنوب مهما كثرت أو عظمت إذا لجأ العبد إليه بالتوبة والاستغفار، يستر ذنوب عباده ولا يفضحهم، ويمنحهم الفرصة للتوبة والرجوع إليه، ويتجاوز عن الخطايا ويمنح الرحمة، ومغفرته واسعة تشمل كل تائب ومستغفر، ويقبل عذر المذنبين برحمة كبير، في القرآن: <specialFont>ﵟوَإِنِّي لَغَفَّارٞ لِّمَن تَابَ وَءَامَنَ وَعَمِلَ صَٰلِحٗا ثُمَّ ٱهۡتَدَىٰﵞ</specialFont> (طه: ٨٢)، وفي الحديث الشريف: « وَالَّذِي نَفْسِي بِيَدِهِ، لوْ لَمْ تُذْنِبُوا لَذَهَبَ اللَّهُ بِكُمْ، وَلَجَاءَ بِقَوْمٍ يُذْنِبُونَ، فَيَسْتَغْفِرُونَ اللَّهَ، فَيَغْفِرُ لهمْ» (مسلم: ٢٧٤٩)."
  },
  {
    "id": "ash-shakur",
    "description":
        "في القرآن الكريم: <specialFont>ﵟإِنَّ رَبَّنَا لَغَفُورٞ شَكُورٌﵞ</specialFont> (فاطر: ٣٤)، من الجذر (شكر)، ويعني الاعتراف بالفضل، والثناء على العمل الصالح، (شَكرَ فلانٌ) أي: قدَّر الفضل، وأظهر الامتنان، والشكورُ: الذي يُثني على الفعل الطيب ويعطي عليه الجزاء الوفير، ويدل على أن الله سبحانه وتعالى يتصف بالكرم والفضل العظيم، يُضاعف الأجر والثواب على الأعمال الصالحة، مهما كانت صغيرة، ويقبل طاعات عباده القليلة ويشكرها بزيادة النعم ورفع الدرجات في الدنيا والآخرة.، ويُحسن إلى عباده رغم أنه لا يحتاج إلى طاعتهم، ويكافئهم برحمته وجوده."
  },
  {
    "id": "al-aliyy",
    "description":
        "قوله تعالى: <specialFont>ﵟوَهُوَ ٱلۡعَلِيُّ ٱلۡكَبِيرُ ﵞ</specialFont> (سبأ: ٢٣)، والعلي مأخوذ من الجذر (علا)، ويعني: الارتفاع والسمو، علا الشيءُ، أي: ارتفع وارتقى، ويدل على أن الله سبحانه وتعالى مُتَفَرِّدٌ بالعلو المطلق، يتسم بالرفعة والعظمة في ذاته وصفاته وأفعاله، لا يدانيه شيء في علو مكانته وقدره، وهو المتعالي عن مشابهة المخلوقات، فلا شيء يعادل علوه وجلاله."
  },
  {
    "id": "al-kabeer",
    "description":
        "قال تعالى: <specialFont>ﵟعَٰلِمُ ٱلۡغَيۡبِ وَٱلشَّهَٰدَةِ ٱلۡكَبِيرُ ٱلۡمُتَعَالِﵞ</specialFont> (الرعد: ٩)، الكبيرُ، مأخوذٌ من الجذر (كبر)، ويعني: الجلال والعظمة، كَبُر الشَّيءُ، أي: عظم وارتفع شأنهُ، والكبير الذي يعلو في المكانة والعظمة، وهو الأعظم الذي لا يدانيه شيء، ويدل على أن الله سبحانه وتعالى هو المتفرد بالعظمة والكبرياء، ولا شيء يُقارَن بعظمته، كبيرٌ في سلطانه وقدرته، يُدير شؤون الكون بأكمله بحكمة، أكبر وأعظم من كل وصف، علو شأنه وكبريائه لا حد لهما، وهو الذي يجعله المؤمنون في قلوبهم فوق كل شيء، ويعظمونه في عبادتهم وحياتهم."
  },
  {
    "id": "al-hafeez",
    "description":
        "قوله تعالى: <specialFont>ﵟوَرَبُّكَ عَلَىٰ كُلِّ شَيۡءٍ حَفِيظٞ ﵞ</specialFont> (سبأ: ٢١)، والحفيظُ: من الجذر (حفظ)، ويعني الصون والرعاية، حفظ الشيء، أي: صانه وحماه، والحفيظُ: هو الذي يقوم بالحفظ المستمر والدقيق، ويصون كل شيء من الأذى أو النسيان، ويدل على أن الله سبحانه وتعالى يحفظ كل شيء بعلمه وإرادته، يحفظ السماء والأرض من الزوال، ويحفظ عباده من الأخطار، لا يغفل عن حفظ مخلوقاته لحظة، فهو الرقيب عليهم في جميع أحوالهم، ويحفظ أعمالهم في كتاب ليجازيهم عليها، ويحفظ المؤمنين من الشرور، ويعتني بهم في الدنيا والآخرة."
  },
  {
    "id": "al-muqit",
    "description":
        "يشير الاسم إلى صفات القدرة والتدبير، فاللهُ المقيتُ القادر على كل شيء، والذي يدبر أمور الخلق ويحفظ أرزاقهم، كما أنه المعطي للقوت، وقد ورد هذا الاسم في القرآن في قوله تعالى: <specialFont>ﵟوَكَانَ ٱللَّهُ عَلَىٰ كُلِّ شَيۡءٖ مُّقِيتٗا ﵞ</specialFont> (النساء: ٨٥)، وقد اختلف العلماء في تفسير معنى (المقيت)، فمنهم من رأى أنه يعني (القادرُ)، وآخرون ذكروا أنه يعني (الحفيظ)، أو: المُعطي للقوت، وكل هذه المعاني تتكامل لتبرز قدرة الله على تدبير شؤون خلقه، وتوفير رزقهم وحفظهم."
  },
  {
    "id": "al-haseeb",
    "description":
        "الحَسِيبُ، مأخوذ من الجذر (حسب)، ويعني: الكفاية والمحاسبة، يُقال: (حسبه) أي كفاه، و(حسَبَ الشيء) أي عدّه وأحصاه، والحسيبُ: هو الذي يُعطي بقدر الكفاية، ويُحصي الأعمال ويُحاسب عليها بدقة، ويعني: أن الله هو الكافي، الحافظ، المحاسب، والشهيد على كل شيء، فهو يحصي أعمال الخلق ويعلمها، ويجازيهم بما يستحقونه من ثواب أو عقاب، وقد ورد هذا الاسم في القرآن الكريم في عدة مواضع، مثل قوله تعالى: <specialFont>ﵟإِنَّ ٱللَّهَ كَانَ عَلَىٰ كُلِّ شَيۡءٍ حَسِيبًاﵞ</specialFont> (النساء: ٨٦)، ويُفهم من الاسم: أن الله يحفظ أعمال الناس ويكفيهم في تدبير شؤونهم، كما يدل على محاسبة الله لعباده على أعمالهم ومقدار ما يقومون به."
  },
  {
    "id": "al-jaleel",
    "description":
        "مأخوذ من الجذر، جلَّ، ويعني العظمة والجلال، وجلَّ الشيء، أي: عظم شأنه، وارتفع قدره، والجليل هو الذي يتصف بالرفعة والعظمة، والذي له المنزلة السامية، والمكانة الرفيعة التي لا يدانيها شيء، ويدل على أن الله سبحانه وتعالى صاحب الجلال والعظمة المطلقة في ذاته وصفاته، منزه عن كل نقص، يخضع له كل مخلوق، ويعظمه جميع من في السماوات والأرض في كل شأن من شؤونه، سواء في الخلق أو التدبير أو الحكم، له الكبرياء الذي يملأ قلوب العباد خشوعا وتعظيما ومهابة له."
  },
  {
    "id": "al-kareem",
    "description":
        "قوله تعالى: <specialFont>ﵟ يَٰٓأَيُّهَا ٱلۡإِنسَٰنُ مَا غَرَّكَ بِرَبِّكَ ٱلۡكَرِيمِ ﵞ</specialFont> (الانفطار: ٦)، من الأصل اللغوي: (كرم)، ويعني الجود، والسخاء، والعطاء الذي لا ينقطع، والكريم: الذي يمنح بلا طلب، ويكرم المستحق وغيره، ويتصف بالفضل، ويدل اسم الكريم على أن الله سبحانه وتعالى هو المعطي بلا حدود، الذي يفيض عطاؤه ورحمته على عباده، يكرمهم في الدنيا بما يحتاجون إليه من رزق ورعاية، وفي الآخرة بما لا عين رأت ولا أذن سمعت، وهو الذي يتجاوز عن زلاتهم ويغفر لهم، ويمنحهم أكثر مما طلبوا أو تمنوا، والكرم عند الله يشمل الرحمة والعفو والتوبة، فلا يقتصر على العطاء المادي فقط."
  },
  {
    "id": "ar-raqeeb",
    "description":
        "ورد اسم الرقيب في القرآن في قوله تعالى: <specialFont>ﵟإِنَّ ٱللَّهَ كَانَ عَلَيۡكُمۡ رَقِيبٗا ﵞ</specialFont> (النساء: ١)، والرقيبُ يعني المراقب والمطلع على كل شيء في السماوات وفي الأرض، لا يغيب عنه شيء من أعمال عباده، ولا يخفى عليه أمر من خلقه، فهو الحافظ والمدبر لأمورهم وشؤونهم بعلم كامل على أتم وجه، لا يغفل عنهم، ويحاسبهم بدقة وعدل."
  },
  {
    "id": "al-wasee",
    "description":
        "قوله تعالى: <specialFont>ﵟإِنَّ ٱللَّهَ وَٰسِعٌ عَلِيمٞﵞ</specialFont> (البقرة: ١١٥)، الواسعُ مأخوذ من الجذر، (وسع)، أي امتد واتسع، و(الواسع) هو الذي لا حد لسعته، سواء في العلم أو العطاء أو الرحمة، ويدل الاسم على أن الله سبحانه وتعالى وسع علمه كل شيء، فلا يغيب عنه شيء في السماوات ولا في الأرض، يعطي بغير حساب، فلا ينفد عطاؤه، ورزقه يمتد ليشمل كل مخلوقاته، ويتسع عفوه ورحمته كل من يلجأ إليه، وعلمه ليحيط بكل ما ظهر وما بطن، وسعته تشمل جميع أوجه كماله، فلا يحدها شيء."
  },
  {
    "id": "al-hakeem",
    "description":
        "قوله تعالى: <specialFont>ﵟإِنَّ رَبَّكَ حَكِيمٌ عَلِيمٞﵞ</specialFont> (الأنعام: ٨٣)، الحكيم من الأصل اللغوي (حكم)، ويعني المنع، والتدبير، والإحكام، حكم الشيءُ، أي: أتقنه وضبطه، والحكيمُ: هو الذي يتصف بالحكمة، ويعرف الأمور على حقيقتها، ويضعها في مواضعها الصحيحة، ويدل الاسم على أن الله سبحانه وتعالى هو المتفرد بالحكمة الكاملة، فلا يُقدِّر شيئًا إلا وله فيه حكمة، ولا يقضي أمرًا إلا وهو الأعلم بالعاقبة، يعلم ما يصلح للخلق، وما فيه خيرهم في الدنيا والآخرة، وكل ما يحدث في الكون جزء من تدبيره الحكيم، سواء أدرك البشر حكمته أم لا، كما أن حكمته تشمل تشريعاته التي شرعها للناس، والتي تهدف إلى تحقيق الخير والصلاح."
  },
  {
    "id": "al-wadood",
    "description":
        "من الجذر (ود)، ويعني المحبة والمودة، والودود هو الذي يُظهر الحب والود في علاقته بعباده، وهو الذي يتصف بالمحبة الكبيرة والعطف، وفي القرآن قوله تعالى: <specialFont>ﵟوَهُوَ ٱلۡغَفُورُ ٱلۡوَدُودُﵞ</specialFont> (البروج: ١٤)، ويعني: أن الله سبحانه وتعالى يحب عباده المؤمنين ويحبونه، يُظهر لهم لطفه ورحمته وعطفه، ويتصف بالمحبة الشاملة لعباده، ويرحمهم بفضله، ويغدق عليهم نعمه، ويشملهم بعطفه ورعايته، يظهر حبه لعباده الصالحين من خلال نعم لا تُحصى، ورزق واسع، ورحمة عظيمة في الدنيا والآخرة، وود الله ود دائم، لا ينقطع ولا يتغير."
  },
  {
    "id": "al-majeed",
    "description":
        "المجيدُ من الجذر (مجد)، ويعني الشرف، والرفعة، والعظمة، ويدل المجيد على السمو والكمال، ويشير إلى من له عظمة لا مثيل لها، قال تعالى: <specialFont>ﵟذُو ٱلۡعَرۡشِ ٱلۡمَجِيدُﵞ</specialFont> (البروج: ١٥)، يدل على أن الله سبحانه وتعالى صاحب المجد والكمال المطلق، الذي لا مثيل له في عظمته ورفعة مكانته، يستحق الثناء والتقديس لجمال صفاته وكمال أفعاله، يُعطي بكرم، ويخلق بإتقان، ويتصف برحمة واسعة وحكمة بالغة، مجده يشمل كل جوانب كماله التي لا تنقص ولا تزول، وهو المتفرد بالكمال في صفاته وأفعاله التي تستحق الثناء."
  },
  {
    "id": "al-mujeeb",
    "description":
        "قوله تعالى: <specialFont>ﵟإِنَّ رَبِّي قَرِيبٞ مُّجِيبٞ ﵞ</specialFont> (هود: ٦١)، ويدل الاسم على قرب الله من عباده وسرعة استجابته لدعائهم، فالله سبحانه وتعالى لا يترك من يلجأ إليه خائبًا، بل يستجيب إما بإعطائه ما طلب، أو بمنحه ما هو أفضل له، أو بدفع ضرر عنه، وإجابة الله قد تكون عاجلة أو مؤجلة لحكمة يعلمها، كما أن الإجابة قد تتجلى في أشكال مختلفة من الخير."
  },
  {
    "id": "al-baith",
    "description":
        "بعث الشيء، أي: أحياه، والباعثُ الذي يرسل الرسل ويوقظ القلوب، ويبعث الموتى للحساب يوم القيامة، ويدل على أن الله سبحانه وتعالى هو الذي يعيد الحياة بعد الموت، ويقيم الخلق من قبورهم ليحاسبهم على أعمالهم، يبعث الحياة في القلوب الغافلة بالإيمان والعلم، ويوقظ النفوس من الضلال إلى الهدى، ويرسل الرسل لدعوة الناس، ويبعث فيهم الحياة الروحية والمعنوية."
  },
  {
    "id": "ash-shaheed",
    "description":
        "قوله تعالى: <specialFont>ﵟوَكَفَىٰ بِٱللَّهِ شَهِيدٗا ﵞ</specialFont> (النساء: ٧٩)، الشهيدُ الذي لا يغيب عنه شيء، ويشهد كل شيء بعلمه وحضوره المطلق، ويدل على أن الله سبحانه وتعالى يشهد جميع أحوال عباده، ويعلم ما يخفون وما يعلنون، وهو الحاضر بعلمه في كل مكان وزمان، لا تغيب عنه الأعمال والأقوال، ويشهد عليها يوم القيامة ليجزي كل إنسان بما عمل، هو الحافظ لكل شيء، الذي يشهد على الأفعال ويرى ما في القلوب، فيستحيل أن تُخفى عليه ذرة."
  },
  {
    "id": "al-haqq",
    "description":
        "قوله تعالى: <specialFont>ﵟفَتَعَٰلَى ٱللَّهُ ٱلۡمَلِكُ ٱلۡحَقُّۗﵞ</specialFont> (طه: ١١٤)، والحق مأخوذ من الجذر (حقَّ)، ويعني الثبات والصحة واليقين، والحقُّ: الشيء الثابت الذي لا يتغير، ويشير إلى الصدق والاستقامة والعدل، ويدل على أن الله سبحانه وتعالى ثابت في ذاته وصفاته، لا يتغير ولا يزول، الحق في كل أفعاله وأحكامه، وكل ما قضاه وأخبر به هو الحق الذي لا ريب فيه، ويدل أيضًا على أن الله يظهر الحق وينصره، ويفصل بين عباده بالحق يوم القيامة، وعبادته هي الحق، والتوكل عليه هو الحق، وكل ما دونه باطل وزائل."
  },
  {
    "id": "al-wakeel",
    "description":
        "مأخوذ من الجذر (وكل)، ويعني التفويض والاعتماد، والوكيلُ: من يُفوّض إليه الأمر، ويقوم به على الوجه الأكمل، ويدل على أن الله سبحانه وتعالى هو الكافي والمعتمد عليه في كل أمور الخلق، فمن يتوكل على الله يجد في توكله كفاية لكل أمر، فهو المدبر والمهيمن على شؤون عباده، العالم بمصالحهم، لا يُخيب من اعتمد عليه، يُطمئن قلوب المتوكلين عليه، فييسر لهم الخير ويدفع عنهم الضر."
  },
  {
    "id": "al-qawiyy",
    "description":
        "قوله تعالى: <specialFont>ﵟإِنَّ رَبَّكَ هُوَ ٱلۡقَوِيُّ ٱلۡعَزِيزُ ﵞ</specialFont> (هود: ٦٦)، والقويُّ: هو الذي يتصف بالقوة الكاملة، ولا يحتاج إلى شيء ليُتمم قوته، فهو المتفرد بالقدرة المطلقة، يدل على أن الله سبحانه وتعالى صاحب القوة المطلقة، الذي لا يُعجزه شيء، قوته لا تتبدل ولا تضعف، وهو القادر على تحقيق كل ما يريده في الكون دون حاجة إلى معين أو مساعد، يمنح القوة للمخلوقات، ويأخذها متى شاء، وقوته تشمل كل شيء في الأرض والسماء، فيخلق ويُدبر ويُحكم كل شيء بقوته."
  },
  {
    "id": "al-mateen",
    "description":
        "قوله تعالى: <specialFont>ﵟ إِنَّ ٱللَّهَ هُوَ ٱلرَّزَّاقُ ذُو ٱلۡقُوَّةِ ٱلۡمَتِينُ ﵞ</specialFont> (الذاريات: ٥٨)، والمتينُ مأخوذ من الجذر (متن)، ويعني الشدة والصلابة والقوة الراسخة، والمتينُ يدل على القوة التي لا تتزعزع، والقدرة التي لا تضعف ولا تزول مهما طال الزمان، ويشير إلى كمال قوة الله وثباته، فهو القوي الذي لا يتغير ولا يضعف، يتصف بالقوة الدائمة التي لا تنفد، ويمنح من يشاء من عباده القوة والثبات، والمتانة في أفعاله وأقداره تعني أن كل ما يصدر عنه هو بحكمة وإتقان، فلا خلل ولا ضعف في خلقه، ولا في تدبيره."
  },
  {
    "id": "al-waliyy",
    "description":
        "من الجذر (ولي)، ويعني القرب والتدبير والرعاية، والوليُّ الذي يعتني بشؤون من يتولاه، ويكون قريبًا منه، ويحفظه ويرعاه، ويدل على أن الله سبحانه وتعالى قريب من عباده المؤمنين، يتولاهم بحفظه وتدبيره، ويعينهم وينصرهم، ويتكفل بمن يلجأ إليه، ويهديه إلى طريق الخير، ويدافع عنه في وجه المخاطر، ولا يتحقق النصر والتوفيق إلا به، ويتولى عباده المؤمنين بالدنيا والآخرة، ويقربهم منه برحمته وفضله."
  },
  {
    "id": "al-hameed",
    "description":
        "قوله تعالى: <specialFont>ﵟوَإِنَّ ٱللَّهَ لَهُوَ ٱلۡغَنِيُّ ٱلۡحَمِيدُﵞ</specialFont> (الحج: ٦٤)، من الجذر (حمد)، ويعني الثناء والشكر، والحميدُ: الذي يستحق الثناء المطلق والشكر على جميع أفعاله، سواء أدرك العبد الحكمة منها أم لم يدرك، ويدل على أن الله سبحانه وتعالى مستحق للحمد والثناء في كل حال، سواء في النعم أو الابتلاء، هو الذي يُحمد على ما أعطى وما منع؛ لأن كل أفعاله قائمة على الحكمة والعدل، كما أن الله يستحق الحمد لما يتصف به من صفات الكمال، مثل الرحمة والعلم والقدرة."
  },
  {
    "id": "al-muhseey",
    "description":
        "مأخوذ من الجذر (أحصى)، ويعني العد والتسجيل والإحاطة، والمحصي: الذي لا يفوته شيء، مهما كان دقيقًا أو صغيرًا، ويعني أن الله سبحانه وتعالى يُحيط علمه بكل شيء، فلا يغيب عنه شيء، وهو الذي يحصي كل صغيرة وكبيرة في الكون بدقة تامة، يعلم عدد الخلق وأعمالهم وأعمارهم وأرزاقهم، ويحصيها جميعًا ليجازيهم عليها يوم القيامة."
  },
  {
    "id": "al-mubdi",
    "description":
        "قوله تعالى: <specialFont>ﵟإِنَّهُۥ هُوَ يُبۡدِئُ وَيُعِيدُﵞ</specialFont> (البروج: ١٣)، مأخوذ من الجذر (بدأ)، ويعني الابتداء أو الإيجاد لأول مرة، والمُبدئ الذي يخلق الكائنات ابتداءً بقدرته وملكوته، ويعني الله سبحانه وتعالى الذي يبدأ الخلق من العدم ويُنشئهم لأول مرة بقدرته وحكمته، أوجد كل شيء بإرادته، من دون مثال سابق، وهو المتفرد بالإبداع في الخلق والتكوين."
  },
  {
    "id": "al-mueed",
    "description":
        "قوله تعالى: <specialFont>ﵟإِنَّهُۥ هُوَ يُبۡدِئُ وَيُعِيدُﵞ</specialFont> (البروج: ١٣)، مأخوذ من الجذر (عاد)، ويعني الرجوع أو التكرار، والمُعيدُ: الذي يعيد الخلق إلى ما كانوا عليه، أو يعيد الحياة بعد الموت، ويدل على أن الله سبحانه وتعالى يعيد الخلق يوم القيامة بعد موتهم للحساب والجزاء، كما أنه يعيد النعم على عباده مرة بعد مرة في الدنيا، يعيد الحياة للقلوب بعد غفلتها بالإيمان، كما يعيد النشأة للإنسان بعد موته، وكل شيء تحت حكمه يعود إلى أصله بأمره."
  },
  {
    "id": "al-muhyiy",
    "description":
        "يعني منح الحياة، و(المُحيي) هو من يُعطي الحياة للأجساد والأرواح، سواء في الدنيا أو عند البعث، ويدل  على أن الله سبحانه وتعالى واهب الحياة، فلا حياة إلا بإذنه، وهو الذي يحيي الأرض بعد موتها، ويبعث النفوس يوم القيامة للحساب، كما أن الله يُحيي القلوب الميتة بالإيمان، وينشر فيها النور بعد الظلام، وإيمان العبد بهذا الاسم يجعله يُدرك أن كل شيء في حياته، من الصحة والرزق والهداية، هو من عند الله المُحيي."
  },
  {
    "id": "al-mumeet",
    "description":
        "المُميتُ: هو الذي يقدر الموت على جميع الكائنات، وينهي حياتهم عند الأجل المقدر، ويدل على أن الله سبحانه وتعالى هو المتصرف في حياة وموت خلقه، فلا يموت أحد إلا بإذنه، إذ جعل الموت بابًا للانتقال من الدنيا إلى الآخرة، وهو الذي يمتحن عباده بالموت ليختبر صبرهم ورضاهم، كما أن الموت ليس نهاية، بل بداية لحياة أخرى فيها الحساب والجزاء، قال تعالى: <specialFont>ﵟهُوَ يُحۡيِۦ وَيُمِيتُ وَإِلَيۡهِ تُرۡجَعُونَﵞ</specialFont> (يونس: ٥٦)."
  },
  {
    "id": "al-hayy",
    "description":
        "قوله تعالى: <specialFont>ﵟوَتَوَكَّلۡ عَلَى ٱلۡحَيِّ ٱلَّذِي لَا يَمُوتُﵞ</specialFont> (الفرقان: ٥٨)، والحيُّ: هو الذي لا تفارقه الحياة، ويستمر وجوده بلا انقطاع، ويدل على أن الله سبحانه وتعالى وحده الذي يملك الحياة الحقيقية الكاملة والدائمة، وحياة الله ليست كحياة المخلوقات، فهي ليست بحاجة إلى سبب أو داعم، ولا تتأثر بمرور الزمن أو الظروف، هو قائم بذاته، وكل شيء في الوجود يعتمد على حياته ليبقى، هو مصدر الحياة لكل مخلوق، وهو الذي يعطي الحياة وينهيها بحكمته."
  },
  {
    "id": "al-qayyum",
    "description":
        "قوله تعالى: <specialFont>ﵟٱللَّهُ لَآ إِلَٰهَ إِلَّا هُوَ ٱلۡحَيُّ ٱلۡقَيُّومُۚﵞ</specialFont> (البقرة: ٢٥٥)، والقيُّوم: هو الذي يدبر ويُقيم كل ما في السماوات والأرض، فلا شيء يستمر إلا بإذنه وحكمه، ويدل على أن الله سبحانه وتعالى هو القائم على كل شيء، لا يفوته تدبير أي أمر في الكون، يُديم الحياة ويرزق كل مخلوق بما يحتاجه، ويُحيي ويميت بحكمته، لا يغفل ولا يعجز، ولا يحتاج إلى النوم أو الراحة، فهو القائم على شؤون عباده في كل لحظة."
  },
  {
    "id": "al-waajid",
    "description":
        "مأخوذ من الجذر (وجد)، ويعني الإدراك والحصول على الشيء، والواجدُ: هو الذي لا يعجزه شيء، ولا تنقصه حاجة، فهو مكتفٍ بذاته، لا يحتاج إلى شيء من مخلوقاته، ويدل على أن الله سبحانه وتعالى مكتمل الغنى والقوة، فلا تنقصه حاجة، ولا يعوزه شيء في خلقه أو تدبيره، يجد كل شيء بمحض إرادته، وملكه لا ينقص مهما أعطى من فضله. هذا الاسم يُعزز في قلب العبد التوكل على الله الذي يملك كل شيء."
  },
  {
    "id": "al-maajid",
    "description":
        "الماجدُ الذي يتصف بالمجد الرفيع، والكرم العظيم الذي لا ينفد، ويدل على أن الله سبحانه وتعالى متفرد بالكمال والجلال في صفاته، كريم في عطائه، فلا يمنع فضله عن عباده، يُظهر عظمته وجلاله في خلقه وتدبيره، ويمنح عباده النعم بكرم وسخاء، ومجده يظهر في صفاته الكاملة التي لا نقص فيها، وفي أفعاله الحكيمة التي تُحيط بكل شيء."
  },
  {
    "id": "al-waahid",
    "description":
        "قوله تعالى: <specialFont>ﵟوَإِلَٰهُكُمۡ إِلَٰهٞ وَٰحِدٞۖﵞ</specialFont> (البقرة: ١٦٣)، ويعني الانفراد والتَّميُّز، والواحدُ: هو الذي لا شريك له ولا مثيل، منفرد في ذاته وصفاته، ويدل على أن الله سبحانه وتعالى منفرد في ألوهيته وربوبيته، فلا مثيل له في صفاته أو أفعاله، ولا يُشبهه أحد في كماله، ولا يُشاركه أحد في ملكه، هو المنفرد بالألوهية، لا يُقارن بشيء، وهو المستحق وحده للعبادة والخضوع."
  },
  {
    "id": "al-ahad",
    "description":
        "قوله تعالى: <specialFont>ﵟقُلۡ هُوَ ٱللَّهُ أَحَدٌ ﵞ</specialFont> (الإخلاص: ١)، الأحدُ يعني التفرُّدُ، ويعني أن الله سبحانه وتعالى متفرد في ذاته، وأسمائه، وصفاته، لا شبيه له ولا مثيل، هو المتوحد بالكمال المطلق، فلا يُماثله أحد في ذاته، ولا يُقاس به شيء في صفاته وأفعاله، هذا التفرد يشمل الكمال المطلق، والإيمان بهذا الاسم يعزز في العبد توحيد الله، ويجعله على يقين بأنه لا ملجأ إلا إلى الله، ولا مستحق للعبادة إلا هو."
  },
  {
    "id": "as-samad",
    "description":
        "قوله تعالى: <specialFont>ﵟٱللَّهُ ٱلصَّمَدُ ﵞ</specialFont> (الإخلاص: ٢)، من الجذر (صَمَدَ)، ويعني قصد الشيء والتوجه إليه في الحاجات، والصَّمدُ: هو السيد الكامل الذي يُعتمد عليه في الأمور كلها، وهو الذي يلجأ إليه الجميع لحاجاتهم، لأنه غني عن كل شيء، ويدل على أن الله سبحانه وتعالى هو المستغني عن جميع خلقه، وكل المخلوقات تعتمد عليه في وجودها ورزقها وتدبير شؤونها، لا يفتقر إلى أحد، لكنه المقصود في كل حاجة، وهو الكافي لعباده في كل ما يطلبون."
  },
  {
    "id": "al-qaadir",
    "description":
        "قوله تعالى: <specialFont>ﵟقُلۡ هُوَ ٱلۡقَادِرُ عَلَىٰٓ أَن يَبۡعَثَ عَلَيۡكُمۡ عَذَابٗا مِّن فَوۡقِكُمۡ أَوۡ مِن تَحۡتِ أَرۡجُلِكُمۡﵞ</specialFont> (الأنعام: ٦٥) مأخوذ من الجذر (قدر)، ويعني التحكم والتمكن من فعل الشيء، والقادرُ: هو الذي يملك القدرة التامة، وينفذ مشيئته بلا معارضة، ويعني الله سبحانه وتعالى المتصف بالقدرة المطلقة على كل شيء، فلا يعجزه شيء في الأرض ولا في السماء، يخلق ما يشاء، ويدبر الأمور بحكمته، ويقدر الأقدار على عباده، فلا حدّ لقدراته، ولا يُعجزه أمر."
  },
  {
    "id": "al-muqtadir",
    "description":
        "قوله تعالى: <specialFont>ﵟ فِي مَقۡعَدِ صِدۡقٍ عِندَ مَلِيكٖ مُّقۡتَدِرِۭ ﵞ</specialFont> (القمر: ٥٥)، ويشير الاسم إلى التمكن الكامل والتحكم المطلق، والمقتدرُ هو الذي بيده جميع الأقدار، لا يخرج شيء عن تدبيره، ولا يعجزه أمر، ويدل على أن الله سبحانه وتعالى متفرد بالقدرة المطلقة على كل شيء، وأن كل ما يحدث في الكون يقع بمقتضى إرادته وتدبيره، هو القادر على تغيير الأحوال، وإيجاد ما يشاء في الوقت الذي يشاء، وفق حكمته، هو المقتدر على تغيير الأقدار، سواء في المنح أو المنع."
  },
  {
    "id": "al-muqaddim",
    "description":
        "المُقَدِّمُ يعني وضع الشيء في المقدمة، أو تقديمه على غيره، وهو الذي يضع بعض الأمور في مكانة متقدمة، أو يقدّمها وفق علمه وحكمته المطلقة، ويدل على أن الله سبحانه وتعالى بيده ترتيب الأمور وتقديم بعضها على بعض بما يحقق مصالح عباده، يقدّم من يشاء من عباده في المكانة أو الرزق أو الهداية، وقد يؤخر لحكمة يعلمها هو، وتقديم الله دائمًا يكون لحكمة بالغة، سواء أدركها العبد أم لم يدركها."
  },
  {
    "id": "al-muakhkhir",
    "description":
        "يعني الإرجاء والتأخير، وهو الذي يضع بعض الأمور في وقتها المناسب أو يُنزلها في مكانتها التي تقتضيها حكمته، ويدل على أن الله سبحانه وتعالى يؤخر بعض الأمور أو الأشخاص لحكمة يعلمها، فقد يؤخر إجابة الدعاء أو الرزق أو النصر ليكون في الوقت الأنسب، وتأخير الله يكون لخير عباده، حتى وإن لم يُدركوا الحكمة في حينه، يغرس هذا الاسم الإيمان في قلب العبد الرضا بقضاء الله، واليقين بأن كل تأخير من الله هو لصالحه."
  },
  {
    "id": "al-awwal",
    "description":
        "قوله تعالى: <specialFont>ﵟ هُوَ ٱلۡأَوَّلُ وَٱلۡأٓخِرُ وَٱلظَّٰهِرُ وَٱلۡبَاطِنُۖ وَهُوَ بِكُلِّ شَيۡءٍ عَلِيمٌ ﵞ</specialFont> (الحديد: ٣)، الأوَّلُ، يعني: البداية والسبق، ويشير إلى من سبَق غيره في الوجود، ولكن فيما يخص الله -جلَّ في عُلاه-، فهو الذي وُجد قبل كل شيء، بلا بداية تُدرك، ويدل على أن الله سبحانه وتعالى هو الأسبق في الوجود، الذي أوجد كل شيء بإرادته، لا شيء قبله، فهو الذي خلق الزمان والمكان والمخلوقات، وهو الأصل لكل شيء، وكل ما في الكون يعتمد عليه في وجوده واستمراره."
  },
  {
    "id": "al-aakhir",
    "description":
        "قوله تعالى: <specialFont>ﵟ هُوَ ٱلۡأَوَّلُ وَٱلۡأٓخِرُ وَٱلظَّٰهِرُ وَٱلۡبَاطِنُۖ وَهُوَ بِكُلِّ شَيۡءٍ عَلِيمٌ ﵞ</specialFont> (الحديد: ٣)، والآخر يعني: ما يأتي بعد الشيء، ولكن الاسم فيما يخص الله سبحانه وتعالى معناه أن وجوده لا يعقبه شيء، إذ هو الدائم الباقي بعد فناء كل المخلوقات، ويدل على أن الله سبحانه وتعالى هو الباقي بعد فناء كل شيء، لا يلحقه زوال أو نقصان، وهو المتفرد بالبقاء الأبدي. يغرس الاسم في قلب المؤمن يقينًا بأن كل شيء في الكون زائل، ولا يبقى إلا وجه الله الكريم، ويدفعه هذا اليقين إلى التعلق بالله وحده، والسعي إلى العمل للآخرة."
  },
  {
    "id": "az-zaahir",
    "description":
        "قوله تعالى: <specialFont>ﵟ هُوَ ٱلۡأَوَّلُ وَٱلۡأٓخِرُ وَٱلظَّٰهِرُ وَٱلۡبَاطِنُۖ وَهُوَ بِكُلِّ شَيۡءٍ عَلِيمٌ ﵞ</specialFont> (الحديد: ٣)، مأخوذ من الجذر (ظهر)، ويعني الوضوح والعلو، والظَّاهرُ: هو الذي تجلت قدرته في كل ما خلق، وعلا فوق كل شيء في سلطانه وحكمه، ويدل على أن الله سبحانه وتعالى ظاهر بأدلته وعلاماته في كل شيء، في السماوات والأرض، لا شيء يخفى عن قدرته وعلمه، وهو الذي ظهر فوق خلقه في علوه وقهره، يُستدل على وجوده بتدبيره للكون، وبكل ما يظهر من عظمة مخلوقاته، ونظامها المحكم."
  },
  {
    "id": "al-baatin",
    "description":
        "قوله تعالى: <specialFont>ﵟ هُوَ ٱلۡأَوَّلُ وَٱلۡأٓخِرُ وَٱلظَّٰهِرُ وَٱلۡبَاطِنُۖ وَهُوَ بِكُلِّ شَيۡءٍ عَلِيمٌ ﵞ</specialFont> (الحديد: ٣)، مأخوذ من الجذر (بطن)، ويعني الخفاء والاستتار، و(الباطنُ): هو الذي لا يظهر بذاته للخلق، لكن علمه يشمل كل خفي ومستتر، ويدل على أن الله سبحانه وتعالى محيط بكل شيء، ظاهرًا وباطنًا، فيعلم ما ظهر وما خفي، قريب من عباده، المُطلع على أسرارهم ونواياهم، يُدبر الأمور من حيث لا يدركها البشر، ويعلم ما تُخفيه الصدور، وما يُبطنه الزمن والمستقبل."
  },
  {
    "id": "al-mutaaali",
    "description":
        "قوله تعالى: <specialFont>ﵟ عَٰلِمُ ٱلۡغَيۡبِ وَٱلشَّهَٰدَةِ ٱلۡكَبِيرُ ٱلۡمُتَعَالِ ﵞ</specialFont> (الرعد: ٩)، من الجذر (علا) الذي يعني الارتفاع والسمو، و(المُتعال) هو من علا عن كل ما لا يليق بجلاله، وارتفع فوق كل شيء بقدرته وحكمته، ويدل على أن الله سبحانه وتعالى عالٍ في ذاته وصفاته، لا يشبهه شيء، ولا يقاس بمخلوقاته، وهو المتعالي عن الظلم والضعف، والمتفرد بالكمال في أفعاله وأقداره، يُظهر لعباده عظمته وجلاله في كل ما خلق وقدَّر، ويفرض عليهم التواضع له، والتسليم لأمره."
  },
  {
    "id": "al-barr",
    "description":
        "قوله تعالى: <specialFont>ﵟإِنَّهُۥ هُوَ ٱلۡبَرُّ ٱلرَّحِيمُﵞ</specialFont> (الطور: ٢٨)  مأخوذ من الجذر (بَرَّ)، ويعني الإحسان والكرم والوفاء، والبَرُّ: هو من يتعامل مع الآخرين بالإحسان التام، مع كمال الرحمة واللطف، ويعني أن الله سبحانه وتعالى الذي يتصف بالإحسان التام إلى عباده، ويمنحهم نعمه الظاهرة والباطنة برحمة ولطف، يُغدق على عباده بالخير، ويعاملهم بما فيه نفعهم، ويتجاوز عن زلاتهم، فيُكرمهم ويهديهم إلى ما فيه صلاحهم في الدنيا والآخرة."
  },
  {
    "id": "at-tawwaab",
    "description":
        "قوله تعالى: <specialFont>ﵟإِنَّهُۥ هُوَ ٱلتَّوَّابُ ٱلرَّحِيمُ ﵞ</specialFont> (البقرة: ٣٧). مأخوذ من الجذر (تاب)، ويعني الرجوع عن الذنب والندم عليه. (تاب العبد) إذا ندم على ذنوبه ورجع إلى الله، والتوابُ: هو الذي يقبل التوبة، ويرشد العباد إليها، ويتوب عليهم مرارًا وتكرارًا، ويدل على سعة رحمة الله بعباده، حيث يقبل توبتهم مهما تكررت أخطاؤهم، ويحب التوابين، ويتوب عليهم بمغفرته، ويبدل سيئاتهم حسنات. يحثُّ هذا الاسم العباد على الإكثار من التوبة والاستغفار، ويبعث الأمل في نفوسهم بأن الله يقبل عودتهم مهما كانت ذنوبهم."
  },
  {
    "id": "al-muntaqim",
    "description":
        "مأخوذ من الجذر (نَقَمَ)، ويعني الأخذ بالحق والعقوبة على الذنب، والمنتقمُ: هو الذي يعاقب الظالمين بما يستحقون من عذاب أو جزاء بعد الإنذار والفرصة، ويدل على أن الله سبحانه وتعالى يعاقب المجرمين والطغاة بعد حلمه وصبره عليهم، ليقيم العدل، ويترك الفرصة للتوبة؛ لكن إذا أصرَّ الظالم على ظلمه، أخذ بحقه من الظالم ونصرَ المظلوم، وانتقام الله ليس انتقامًا عبثيًّا، بل هو انتقام عدل، يُظهر فيه حكمته وعدالته."
  },
  {
    "id": "al-afuww",
    "description":
        "قوله تعالى: <specialFont>ﵟإِنَّ ٱللَّهَ كَانَ عَفُوًّا غَفُورًا ﵞ</specialFont> (النساء: ٤٣)، اسم (العفو) يدل على أن الله سبحانه وتعالى يتجاوز عن الذنوب ويزيل آثارها برحمته وكرمه، لا يعاقب على الذنب الذي يعفو عنه، بل يمحوه كأنه لم يكن، يغفر حتى لمن أسرفوا على أنفسهم إذا عادوا إليه تائبين."
  },
  {
    "id": "ar-rauf",
    "description":
        "قال تعالى: <specialFont>ﵟإِنَّ رَبَّكُمۡ لَرَءُوفٞ رَّحِيمٞ ﵞ</specialFont> (النحل: ٧)، من الجذر (رأف)، ويعني الرحمة الممزوجة باللطف والرفق، والرأفة أرقى درجات الرحمة، لأنها تعبر عن إحسان بلا مشقة أو عتاب، ويدل على أن الله سبحانه وتعالى يتعامل مع عباده بلطف بالغ، فيخفف عنهم ما يثقلهم، وييسر لهم أمورهم، ورأفته تتجلى في كل ما يصيبُ العبد من رحمة ولطف، سواء في الابتلاءات التي تحمل خيرًا خفيًا، أو في النعم التي تصله بكرم منه، والرؤوفُ: هو الذي يفتح للعباد أبواب التوبة والمغفرة، ويعفو عنهم برأفة وحنان."
  },
  {
    "id": "maalikul-mulk",
    "description":
        "(مالك) يعني: التملك والسيطرة التامة على شيء، و(المُلْك) يشير إلى السلطة والسيادة الشاملة التي لا يحدها زمان أو مكان، قال تعالى: <specialFont>ﵟقُلِ ٱللَّهُمَّ مَٰلِكَ ٱلۡمُلۡكِ تُؤۡتِي ٱلۡمُلۡكَ مَن تَشَآءُ وَتَنزِعُ ٱلۡمُلۡكَ مِمَّن تَشَآءُ وَتُعِزُّ مَن تَشَآءُ وَتُذِلُّ مَن تَشَآءُۖ بِيَدِكَ ٱلۡخَيۡرُۖ إِنَّكَ عَلَىٰ كُلِّ شَيۡءٖ قَدِيرٞ ﵞ</specialFont> (آل عمران: ٢٦)، ويعني أن الله سبحانه وتعالى يملك كل شيء في السماوات والأرض ملكًا مطلقًا، هو المتصرف في كل شيء بقدرته وحكمته، لا شريك له في ملكه، يمنح الملك والسلطة لمن يشاء، وينزعها ممن يشاء وفق حكمته وعدله. ملكه دائم وأبدي، لا يزول ولا ينقص مهما أعطى."
  },
  {
    "id": "dhul-jalaali-wal-ikraam",
    "description":
        "قوله تعالى: <specialFont>ﵟتَبَٰرَكَ ٱسۡمُ رَبِّكَ ذِي ٱلۡجَلَٰلِ وَٱلۡإِكۡرَامِﵞ</specialFont> (الرحمن: ٧٨)، الجلال يعني العظمة والرفعة، والإكرام يعني العطاء، والسخاء، والفضل، وكلمة (ذو) في اللغة، تعني: الصاحب أو المالك. يجمع هذا الاسم بين معاني العظمة والهيبة لله عز وجل، وبين معاني الرحمة والفضل التي يُكرم بها عباده، فالله ذو الجلال والإكرام هو الذي يُخضع كل شيء لهيبته، وهو من يُكرم عباده بالرزق والهداية والمغفرة، يعكس هذا الاسم الكمال المطلق في صفات الله، فهو الجليل الذي يُرهب بقدره وعظمته، والكريم الذي يمنح العطاء والفضل."
  },
  {
    "id": "al-muqsit",
    "description":
        "من الجذر (قسط)، ويعني العدل والإنصاف، والمقسطُ هو الذي يحقق العدالة بين الناس، سواء في الأحكام أو الأقدار، وينصف من يستحق الإنصاف، ويدل على أن الله سبحانه وتعالى يقيم العدل بين الخلق، ويُحكم فيهم بما يستحقون دون ظلم، ويعاملهم بالحكمة، فيعطي كل ذي حق حقه، ويرد المظالم، ويحاسب بالعدل يوم القيامة،كما أن عدله يشمل النعم والابتلاءات، فيوزع الأقدار بما يناسب حكمته المطلقة."
  },
  {
    "id": "al-maani",
    "description":
        "مأخوذ من الجذر (مَنَعَ)، ويعني الحجب والصد عن الوصول، والمانعُ: هو الذي يحجب الضر أو يمنع بعض النعم لتحقيق غاية أو لحكمة يعلمها، ويدل على أن الله سبحانه وتعالى يمنع الضر أو النعم بقدرته ورحمته، وفق حكمته التي قد لا يدركها البشر، ويحجب ما لا يصلح للعبد، ويدفع عنه الشر، حتى لو لم يدرك ذلك العبد في وقته، وقد يمنع الله شيئًا عن عبده ليمنحه خيرًا أعظم، أو ليختبر صبره وإيمانه، كما أن منع الله لبعض النعم قد يكون تنبيهًا أو تهذيبًا للنفوس."
  },
  {
    "id": "al-ghaniyy",
    "description":
        "قال تعالى: <specialFont>ﵟيَٰٓأَيُّهَا ٱلنَّاسُ أَنتُمُ ٱلۡفُقَرَآءُ إِلَى ٱللَّهِۖ وَٱللَّهُ هُوَ ٱلۡغَنِيُّ ٱلۡحَمِيدُﵞ</specialFont> (فاطر: ١٥)، والغني هو من يملك ما يغنيه عن الاعتماد على غيره، ويمنح الغنى لغيره أيضًا، ويدل على كمال الله سبحانه وتعالى واستغنائه عن كل شيء، فلا حاجة له إلى خلقه أو عبادتهم، بينما الخلق جميعًا مفتقرون إليه، يُفيض على عباده من فضله ورزقه، فيغنيهم عما يشق عليهم، سواء ماديًا بالمال أو معنويًا بالقناعة والطمأنينة، وغنى الله مطلق ودائم، لا ينقصه العطاء، بل يزداد فضلًا وكرمًا."
  },
  {
    "id": "al-mughniyy",
    "description":
        "مأخوذ من الجذر (غَنِيَ(، والمُغْنِيُّ: هو الذي يرزق عباده ما يسد حاجاتهم، سواء في الأمور المادية أو المعنوية، ويدل على أن الله سبحانه وتعالى هو الذي يمنح الغنى لمن يشاء، ويرزقهم بما يجعلهم مكتفين، وغنى الله يتجلى في كل شيء؛ فقد يكون الغنى بالرزق المادي، أو بالطمأنينة في القلب، أو بالقناعة التي تجعل الإنسان سعيدًا بما لديه، يوسع على عباده من فضله، ويمنحهم ما يكفيهم في الدنيا والآخرة."
  },
  {
    "id": "al-jaami",
    "description":
        "قوله تعالى: <specialFont>ﵟرَبَّنَآ إِنَّكَ جَامِعُ ٱلنَّاسِ لِيَوۡمٖ لَّا رَيۡبَ فِيهِۚﵞ</specialFont> (آل عمران: ٩)، من الجذر (جمع)، ويعني ضم الأشياء المتفرقة في وحدة واحدة، والجامعُ: هو الذي يجمع ما تفرق بحكمة وإحكام، سواء كان ذلك في الدنيا أو الآخرة، ويدل على أن الله سبحانه وتعالى يجمع الخلق يوم القيامة للحساب، ويجمع أرواح العباد مع أجسادهم، في الحياة الدنيا، يجمع الله القلوب المتآلفة، ويجمع الخير والرزق والهداية لمن يشاء، كما أنه -جلَّ في عُلاهُ- جامع بين صفات الجلال والجمال في أفعاله وصفاته، ويجمع بين المتناقضات لتعمل معًا في انسجام تام وفق حكمته البالغة."
  },
  {
    "id": "ad-daarr",
    "description":
        "يشير (الضَّارُ) إلى من يملك القدرة على إيصال الضرر أو الأذى، لكن مع الحكمة والعدل، ويدل على أن الله سبحانه وتعالى هو المتصرف في كل شيء، وله الحكمة في تقدير ما ينفع وما يضر، والضر الذي يأتي من الله قد يكون لحكمة عظيمة، مثل تطهير النفوس من الذنوب، أو تنبيه العباد للعودة إلى طريق الصواب، ولا يأتي الضر من الله عبثًا أو ظلمًا، بل هو ضمن نظام إلهي شامل، يحقق الخير البعيد للإنسان، حتى وإن كان في صورة ابتلاء أو مصيبة."
  },
  {
    "id": "an-naafi",
    "description":
        "مأخوذ من الجذر (نفع)، ويعني: تحقيق الخير والفائدة، والنافعُ: الذي يمنح الخير ويحقق الفائدة لمن يشاء، ويدل على أن الله سبحانه وتعالى مصدر كل نفع في الدنيا والآخرة، ولا يصيب العبد نفعٌ إلا بإرادته، ولا يحدث الخير إلا بقدرته، يجلبُ الخير لعباده برحمته، سواء أكان في الرزق، أو الصحة، أو الهداية، أو التوفيق في الأعمال، كما أن الله يُعطي المنفعة الروحية والنفسية بالإيمان والهداية إلى الصراط المستقيم."
  },
  {
    "id": "an-noor",
    "description":
        "قوله تعالى: <specialFont>ﵟٱللَّهُ نُورُ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِۚﵞ</specialFont> (النور: ٣٥)، ويعني النورُ: الضياء والإشراقُ، والنورُ معنويا يدل على الهداية والوضوح، حيث يُزيل الله بنوره الظلمات الحسية والمعنوية من حياة الإنسان، ويدل على أن الله سبحانه وتعالى مصدر كل نور في الكون، سواء كان نورًا ماديًا أم معنويًا، ونوره يشمل الهداية إلى الحق، وطمأنينة القلب بالإيمان، كما أنه يُضيء بنوره طريق المؤمنين، ويوجههم إلى ما فيه الخير في الدنيا والآخرة، ولا يُدرك نوره بالعقول المجردة، ولكنه يتجلى في آيات الكون وفي قلوب المؤمنين."
  },
  {
    "id": "al-haadi",
    "description":
        "قوله تعالى: <specialFont>ﵟوَكَفَىٰ بِرَبِّكَ هَادِيٗا وَنَصِيرٗاﵞ</specialFont> (الفرقان: ٣١)، الإرشاد إلى الطريق الصحيح والاهتداء إلى الخير، والهاديُّ: من يُرشد ويوجه بلطف وحكمة، ويمنح التوفيق لمن يشاء من عباده، والهادي الذي هدى خلقه، إلى معرفته وربوبيته، وسبل الخير، ويدل على أن الله سبحانه وتعالى هو المتكفل بهداية الخلق، فيرشدهم إلى ما ينفعهم ويجنبهم ما يضرهم، وهدايته تشمل الإرشاد إلى الحق، والتوفيق إلى الخير، والهداية إلى طريق الجنة، يهدي المؤمنين إلى الطاعات، ويهدي التائهين إلى الإيمان، ويمدهم بالنُّور الذي يضيء لهم طريق الحياة المستقيم."
  },
  {
    "id": "al-badee",
    "description":
        "من الجذر (بدع)، ويعني الإتيان بشيء جديد لم يكن له مثال سابق، قال تعالى: <specialFont>ﵟبَدِيعُ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِۖﵞ</specialFont>  (البقرة: ١١٧)، يدل على أن الله سبحانه وتعالى يخلق بإبداع، دون أن يحتاج إلى مثال سابق، وكل ما خلقه يتميز بالكمال والجمال والتناسق، من السماوات والأرض إلى أدق تفاصيل المخلوقات."
  },
  {
    "id": "al-baaqi",
    "description":
        "من الجذر (بَقِيَ)، والذي يعني الدوام والثبات، ويدل على من يستمر وجوده دون انقطاع، ويبقى بعد زوال كل شيء، ويشير إلى أن الله سبحانه وتعالى وحده الدائم الذي لا يزول، بينما كل ما سواه من المخلوقات إلى زوال، لا يُدركه التغير، ولا يطرأ عليه الفناء، ويبقى بعد فناء السماوات والأرض، وهو الحي الدائم الذي ليس له نهاية، دوامه أزلي أبدي."
  },
  {
    "id": "al-waarith",
    "description":
        "قوله تعالى: <specialFont>ﵟوَإِنَّا لَنَحۡنُ نُحۡيِۦ وَنُمِيتُ وَنَحۡنُ ٱلۡوَٰرِثُونَﵞ</specialFont> (الحجر: ٢٣)، ويدل الاسمُ على أن الله سبحانه وتعالى هو الباقي بعد زوال كل شيء، والمالك الحقيقي الذي تعود إليه الأمور كلها، فالدنيا وما فيها زائلة، ولا يدوم إلا ملكه، هو المالك قبل الخلق وبعد فنائهم، وكل ما يملكه الإنسان في الدنيا إنما هو عارية مؤقتة، وما يبقى ويدوم هو ما عند الله."
  },
  {
    "id": "ar-rasheed",
    "description":
        "من الجذر (رشد)، يعني الهداية إلى الصواب والاستقامة، رشد فلانٌ: إذا اهتدى وعرف الطريق الصحيح، والرَّشيدُ: يدل على من يُحسن التدبير والهداية، ويرشد إلى الحق دون انحراف، ويدل على أن الله سبحانه وتعالى يهدي عباده إلى ما فيه صلاحهم، ويُرشدهم إلى الطريق القويم، ولا يصدر عنه إلا ما هو صواب، وتدبيره لحياة الخلق قائم على الحكمة المطلقة، يوجههم إلى الخير، ويوفر لهم سبل الهداية ويمنحهم التوفيق لمن اختاروا اتباعه."
  },
  {
    "id": "as-saboor",
    "description":
        "مأخوذ من الجذر (صبر)، ويعني التحمل والثبات أمام الشدائد، والصَّبورُ: من يصبر طويلاً على الأذى والمخالفة، ويعطي المهلة قبل اتخاذ أي إجراء، ويدل على أن الله سبحانه وتعالى يتصف بالصبر المطلق على عباده، فلا يعجل في معاقبة المسيئين، بل يمهلهم ليتوبوا ويرجعوا إليه، وصبره يتجلى في أنه لا يعاقب الناس فوراً على ذنوبهم، بل يفتح لهم أبواب التوبة والمغفرة، ويمنحهم الفرصة للعودة إلى الطريق المستقيم."
  }
];
