Repository: igobhaktiar/moshaf-m_page_fixes
Catalog: lib/l10n/app_*.arb
Languages: ar

# app_name
source: Ten Readings Quran
ar: مصحف الكويت

source: Small
ar: صغير

source: Medium
ar: متوسط

source: Large
ar: كبير

# showJuzPopup
source: Popup Juza icons
ar: تفعيل تنبيه اﯾﻘوﻧﺔ الحزب والجزء

source: Tafseer
ar: التفسير

source: Listen
ar: استماع

source: Bookmarks
ar: العلامات المرجعية

source: Readings
ar: القراءات

source: Osoul
ar: الأصول

source: Shwahid
ar: الشواهد

source: Hwamish
ar: الهوامش

source: Holy Quran
ar: القرآن الكريم

source: Ten Readings
ar: القراءات العشر

source: Enter search word
ar: أدخل كلمة البحث

source: There are no current search results
ar: لا يوجد نتائج حالية

# you_can_search_by_surah_name_or_by_word_within_a_surah
source: You can search by surah name or by word within the surah
ar: يمكنك البحث باسم السورة أو كلمة من السورة

# no_search_results_found
source: No results found!
ar: لا توجد نتائج!

# quuarn_fihris
source: Quran Index
ar: فهرس القرآن الكريم

# the_ayah
source: Ayah
ar: الآية

# the_surah
source: Surah
ar: السورة

# the_juz
source: Juz
ar: الجزء

# the_hizb
source: Hizb
ar: الحزب

# the_page
source: Page
ar: الصفحة

source: Page
ar: صفحة

source: Pages
ar: صفحات

# its_ayat_female
source: its ayat
ar: آياتها

# its_ayat_male
source: its ayat
ar: عدد الآيات

source: ayat
ar: الآيات

source: swar
ar: السور

source: ahzab
ar: الأحزاب

source: ajzaa
ar: الأجزاء

source: Surah
ar: سورة

source: Hizb
ar: حزب

source: Juz
ar: جزء

source: Ayah
ar: آية

source: Navigate to Page
ar: الانتقال إلى الصفحة

source: Enter page number
ar: أدخل رقم الصفحة

source: Current Page
ar: الصفحة الحالية

source: Go to Page
ar: اذهب إلى الصفحة

# quarn_khatmah
source: Quran Khatmah
ar: ختمة قرآن

source: New khatmah
ar: ختمة جديدة

source: date created
ar: تاريخ الإنشاء

source: completed awrad
ar: الأوراد المكتملة

# create_khatma
source: Create Khatmah
ar: أنشئ ختمة

source: today's werd
ar: ورد اليوم

source: werd
ar: ورد

# the_werd
source: Werd
ar: الورد

source: werd completed
ar: أكملت الورد

source: Read the werd
ar: اقرأ هذا الورد

# notify
source: reminder
ar: تذكير

source: daily werd
ar: الورد اليومي

# awrad_fihris
source: Awrad table
ar: فهرس الاوراد

source: Total werds
ar: مجموع الأوراد

source: Delete khatma
ar: حذف الختمة

source: suggested khatmat
ar: ختمات مقترحة

source: custom khatmah
ar: ختمة مخصصة

source: khatma name
ar: اسم الختمة

source: Enter khatma name
ar: أدخل اسم الختمة

source: Delete
ar: حذف

source: Favourites
ar: المفضلة

source: General Settings
ar: الإعدادات العامة

source: UI Language
ar: لغة واجهة المستخدم

source: Notifications and Reminders
ar: الإشعارات والتذكيرات

source: Notifications
ar: الإشعارات

source: Appearance
ar: المظهر

source: khatmah daily werd
ar: ورد الختمة اليومي

source: Automatic
ar: تلقائي

source: according to device settings
ar: حسب إعدادات الجهاز

source: Light mode
ar: الوضع الساطع

source: White mode
ar: الوضع الأبيض

source: Golden mode
ar: الوضع الذهبي

source: Dark mode
ar: الوضع الليلي

source: Storage
ar: التخزين

source: Audio
ar: تلاوات المصحف

source: Advanced Settings
ar: إعدادات متقدمة

source: Display on startup
ar: عرض عند بدء التشغيل التطبيق

source: Ayat Interactive Menu
ar: قائمة الآيات التفاعلية

source: Expanded
ar: موسع

# expanded_details
source: Have a detailed menu after your Ayat selection
ar: احصل على قائمة مفصلة بعد اختيار آيات

source: Compact
ar: المدمج

# compact_details
source: Have an all in one compact menu after your Ayat selection
ar: احصل على قائمة مدمجة الكل في واحد بعد اختيار آيات

source: Listen in background
ar: استماع في الخلفية

source: Show bookmarks at start
ar: عرض العلامات المرجعية عند التشغيل

source: Show Alfatiha
ar: عرض الفاتحة

# start_the_app_show_page_one
source: Start the app and show page 1
ar: ابدأ التطبيق واعرض الصفحة 1

source: Show last position
ar: عرض من المكان السابق

source: Start the app show from last position
ar: ابدأ عرض التطبيق من الموضع الأخير

source: Show the index
ar: عرض الفهرس

source: Start the app show the index
ar: ابدأ تشغيل التطبيق وأظهر الفهرس

source: Start the app show bookmarks
ar: بدء تشغيل التطبيق لإظهار الإشارات المرجعية

source: Security and Usage Policy
ar: الأمان وسياسة الاستخدام

source: Privacy Policy
ar: سياسة الخصوصية

source: Terms of use
ar: شروط الاستخدام

source: About App
ar: عن التطبيق

# no_khatmat
source: You don't have any current khatmat
ar: لا توجد ختمات حالية

# no_khatmat_msg
source: Create a new khatmah to start
ar: فضلاً، أنشئ ختمة قرآنية جديدة للبدء

# do_you_want_to_delete_this_item
source: Do you want to delete {placeholder}?
ar: هل تريد مسح {placeholder}؟

# do_you_wannt_to_download_the_full_quran_for_reciter
source: Do_you_want_to_download_the_full_quran_for {reciterName}
ar: هل تريد تحميل القرءان بصوت القارئ {reciterName}

source: downloading files in the background
ar: بدأ تحميل الملفات في الخلفية

# checking_for_updates
source: Downloading Ten-Readings files updates
ar: جاري تحديث ملفات القراءات العشر

# this_page_is_being_downloaded
source: Please wait, files of this page are being downloaded
ar: ملفات الصفحة الحالية قيد التحميل الرجاء الانتظار قليلاً

source: Downloading...
ar: جاري التحميل...

# download_full_quran_ten_readings_files
source: Download full quran files
ar: تحميل المصحف بالكامل

source: This item
ar: هذا العنصر

source: Do you want to download all Quran Ten-readings files?
ar: هل تريد تحميل ملفات القراءات العشر للمصحف بأكمله؟

# this_reciter_files
source: This reciter's files
ar: ملفات هذا القارئ

source: reciter_files_have_been_deleted_successfully
ar: تم حذف ملفات القارئ بنجاح

source: Files deleted successfully
ar: تم حذف الملفات بنجاح

source: Error while deleting
ar: حدث خطاً أثناء الحذف حاول مرة أخرى

source: YES
ar: نعم

source: Ok
ar: حسناً

source: NO
ar: لا

# about
source: Approximately
ar: تقريباً

# khatma_juz
source: Juz khatma
ar: ختمة جزء

# khatma_hizb
source: Hizb khatma
ar: ختمة حزب

# khatma_half_hizb
source: Half a hizb khatma
ar: ختمة نصف حزب

# day_single_in_arabic
source: days
ar: يوماً

source: days
ar: أيام

source: Khatmah duration
ar: مدة الختمة

source: from
ar: من

source: to
ar: إلى

# add_abookmark_to_unlock_this_option
source: Add a bookmark first to unlock this option
ar: فضلاً، قم بإضافة علامة مرجعية لتفعيل هذا الخيار

source: the background will be dark
ar: الخلفية ستصبح بالوضع الليلي الغامق

source: the background will be light
ar: الخلفية ستصبح باللون الابيض

source: the background will be white color
ar: الخلفية ستكون فاتحة

source: the background will be light yellow color
ar: الخلفية ستصبح باللون الأصفر الفاتح

source: language
ar: اللغة

source: Audio files
ar: الملفات الصوتية

source: Bookmarks list is empty!
ar: قائمة العلامات المرجعية فارغة!

source: Notes list is empty!
ar: قائمة الملاحظات فارغة!

source: Notes
ar: الملاحظات

source: Favourites list is empty!
ar: قائمة المفضلة فارغة!

source: Khatmah awrad
ar: أوراد الختمة

source: Lock screen
ar: شاشة القفل

# add_to_favs
source: Add to favourites
ar: إضافة للمفضلة

source: Add to bookmarks
ar: إضافة علامة مرجعية

source: Create a Note
ar: قم بإنشاء ملاحظة

source: bookmark name
ar: اسم العلامة المرجعية

source: skip
ar: تخطي

source: + Add
ar: + إضافة

# please_choose_reciter
source: Select Reciter
ar: الرجاء اختيار القارئ

source: confirm
ar: تأكيد

# please_choose_repetition
source: Please select repetition
ar: الرجاء اختيار الترديد

source: verse Repetition
ar: ترديد الآية

source: Verse repetition count
ar: عدد تكرار الآية

source: Section Repetition
ar: ترديد المقطع

source: number
ar: رقم

source: section repetition count
ar: عدد تكرار المقطع

source: Quarter
ar: ربع

# single_page
source: Page
ar: صفحة

source: Make sure to assign a name to the new khatmah!
ar: تأكد من إدخال اسم للختمة الجديدة!

source: Are you sure to delete this khatmah?
ar: هل أنت متأكد أنك تريد حذف الختمة؟

# of_from
source: of
ar: من

source: Restart khatmah
ar: بدء الختمة مرة أخرى

source: AM
ar: ص

source: PM
ar: م

# we_must_download_10_readings_file_first
source: You must download Ten-Readings files first to continue to the Ten-Readings copy of the Quran
ar: يجب تحميل بعض الملفات الهامة قبل عرض مصحف القراءات العشر وهي الملفات المتعلقة بالقراءات مثل: -الكلمات الخلافية -الأصول -الشواهد -الهوامش

# download_current_juz_now
source: Download current juz files
ar: تحميل ملفات الجزء الحالي

source: No Thanks
ar: لا شكراً

# tafseer_not_available_currently
source: Tafseer is not currently available, It will be added soon
ar: التفسير ليس متاحاً في الوقت الحالي وستتم إضافته قريباً

# no_kalemat_khelafia_in_this_page
source: There no Different readings in current page
ar: لا توجد كلمات خلافية في الصفحة الحالية

# no_osoul_in_this_page
source: There is no Osoul in current page
ar: لا توجد أصول في الصفحة الحالية

# no_shwahid_in_this_page
source: There is no Shwahid in current page
ar: لا توجد شواهد في الصفحة الحالية

# no_hwamish_in_this_page
source: There is no Hwamish in current page
ar: لا توجد هوامش في الصفحة الحالية

source: it's time to read your daily werd from
ar: حان الآن موعد قراءة وردك اليومي من ختمة

# download_current_page_files
source: Download current page's files
ar: تحميل ملفات الصفحة الحالية

source: Start over
ar: البدء من جديد

source: Read on
ar: متابعة القراءة

source: Ten-Readings files
ar: ملفات القراءات العشر

source: Share Ayah
ar: شارك الآية

# share_app
source: Share the application
ar: شارك التطبيق

source: listen to ayah
ar: استمع للآية

source: First Quarter
ar: ربع

source: Second Quarter
ar: نصف

source: Listen from this ayah
ar: استمع بداية من الآية

# check_your_internet_connection
source: Download stopped, no internet connection
ar: تأكد من اتصالك بالإنترنت

source: Third Quarter
ar: ثلاثة أرباع

# do_you_want_download_full_quran_sound_for_this_reciter
source: Do you want to download the full quran sounds for this reciter?
ar: هل تريد تحميل المصحف بالكامل بصوت القارئ؟

# external_library_title
source: Rewayat
ar: مصاحف الروايات

# show_ten_readings_contents
source: Show Ten-Readings content
ar: عرض محتوى القراءات العشر

source: Show khatmat list
ar: عرض قائمة الختمات

source: Share ayah as image
ar: مشاركة الآية كصورة

source: something went wrong
ar: حدث خطأ ما

source: Custom
ar: مخصص

source: From surah
ar: من سورة

source: To surah
ar: إلى سورة

source: select surah
ar: اختر سورة

source: select ayah
ar: اختر آية

# ayah_number
source: Ayah
ar: الآية رقم

source: Please select ayat range first
ar: من فضلك اختر البداية والنهاية أولاً

# dark_mode_is_not_available_currently_for_tenreadings_mode
source: Currently dark mode is not available for_Ten Readings mode
ar: الوضع الداكن غير متاح حالياً في القراءات العشر

# continue_to_ten_readings
source: Proceed
ar: متابعة

source: Cancel
ar: إلغاء

# no_rewayat
source: There are no rewayat stored locally
ar: لا يوجد مصاحف روايات مخزنة

# finish_downloading
source: Finished downloading!
ar: تم التحميل

# this_content_will_be_available_soon
source: This content will be available soon inshallah
ar: سيتوفر هذا المحتوى قريباً إن شاء الله

source: loading...
ar: جاري التحميل...

source: Please wait while other downloads finish
ar: يرجى الانتظار لحين انتهاء التحميل الحالي

# please_update_app_to_get_new_features
source: Please update the app to benefit from the content and new features
ar: الرجاء تحديث التطبيق للاستفادة من المحتوى والخصائص الجديدة

source: Update
ar: تحديث

source: Later
ar: لاحقاً

source: App needs to download essential files to start
ar: يحتاج التطبيق إلى تحميل بعض الملفات الهامة قبل بدء الاستخدام

# start_download
source: Start downloading
ar: ابدأ التحميل

source: Continue downloading
ar: استمرار

# internet_connection_broken
source: Internet connection has been lost
ar: انقطع الاتصال بالإنترنت أثناء التحميل

source: Downloading app files to start...
ar: جاري تحميل ملفات التطبيق لبدء التشغيل...

source: Al Tarjuma
ar: الترجمة

source: Asbab Al Nuzool
ar: اسباب النزول

source: Your notes
ar: ملاحظاتیی

source: Add Note
ar: اضف ملاحظة

source: Title
ar: عنوان

source: Notes Content
ar: محتوى الملاحظات

# tap_ayahs_your_want_to_add
source: Tap on the Ayahs you want to add to share list
ar: اضغط على الآيات التي تريد إضافتها إلى قائمة المشاركة

# press_share_when_finished
source: Press share button when finished
ar: اضغط على زر المشاركة عند الانتهاء

source: Ayah added
ar: وأضاف أبي

source: Sharing cancelled
ar: تم إلغاء المشاركة

source: Please wait
ar: انتظر من فضلك

source: Do you want to share multiple ayahs
ar: هل ترغب في مشاركة آيات متعددة

source: Waiting to record
ar: في انتظار التسجيل

source: Quran
ar: المصحف الشريف

source: Index
ar: الفهرس

source: Search
ar: البحث

source: Commas
ar: الفواصل

source: Recitation
ar: التلاوة

source: Translation
ar: الترجمة

source: Khatma
ar: الختمة

source: Holy Quran Radio
ar: إذاعة القرآن الكريم

# supplication_to_complete_quran
source: A supplication to complete the Qur'an
ar: دعاء ختم القرآن

# introduction_to_holy_quran
source: Introduction to the Holy Quran
ar: التعريف بالمصحف

source: Settings
ar: الإعدادات

source: Instructions
ar: تعليمات الاستخدام

source: About the app
ar: حول التطبيق

source: Additional Features
ar: مميزات اضافية

source: Moshaf Options
ar: خيارات المصحف

source: Quran Text Color
ar: لون نص القرآن الكريم

source: Moshaf Background Color
ar: لون خلفية المصحف

source: Tafseer Book
ar: كتاب التفسير

source: Reciters
ar: خيارات صور القراء

# select_background_color
source: Select a color to be the background of moshaf screen
ar: اختر اللون الذي تريد أن يكون خلفية شاشة المصحف

source: Reset to default
ar: إعادة التعيين إلى الوضع الافتراضي

# show_reciter_images
source: See reciter images when listening
ar: شاهد صور القارئ عند الاستماع

source: See images when listening
ar: شاهد الصور عند الاستماع

# dont_see_images_when_listening
source: Don't see reciters images when listening
ar: لا أرى صور القراء عند الاستماع

source: Dark Text Shade
ar: ظل النص الداكن

source: Shade of Quran text in dark mode
ar: ظل نص القرآن في الوضع المظلم

source: Zoom
ar: تكبير

source: Playlist
ar: قائمة التشغيل

source: No Surahs found
ar: لم يتم العثور على سور

source: No Playlists found
ar: لم يتم العثور على قوائم التشغيل

# reciterAvailableSoon
source: Reciter will be available soon
ar: سيكون القارئ متاحًا قريبًا

source: Download completed!
ar: تم اكتمال التحميل!

# surahAddedToPlaylist
source: Surah added to playlist successfully
ar: تمت إضافة السورة إلى قائمة التشغيل بنجاح

source: Audio not available
ar: الصوت غير متاح

source: Deleted successfully
ar: تم الحذف بنجاح

source: Create New Playlist
ar: إنشاء قائمة تشغيل جديدة

source: Playlist Name
ar: اسم قائمة التشغيل

source: Playlist name cannot be empty
ar: لا يمكن أن يكون اسم قائمة التشغيل فارغًا

source: Submit
ar: إرسال

source: Edit Playlist
ar: تعديل قائمة التشغيل

source: New Playlist Name
ar: اسم قائمة التشغيل الجديدة

source: All Playlists
ar: جميع قوائم التشغيل

source: Add Playlist
ar: إضافة قائمة تشغيل

source: Are you sure you want to delete this
ar: هل أنت متأكد أنك تريد حذف هذا

source: Names of Allah
ar: الأسماء الحسنى

source: now playing...
ar: الآن يعرض...

source: Quran QA
ar: أسئلة قرآنية

source: Library
ar: المكتبة

# noBookAvailable
source: No books available at the moment
ar: لا توجد كتب متاحة في الوقت الحالي

source: Share Ayah
ar: شارك آية

source: Share Tafseer
ar: شارك التفسير

source: Add next Ayah
ar: إضافة الآية التالية

source: Share Translation
ar: مشاركة الترجمة

source: Play Again
ar: العب مرة أخرى

source: Review Answer
ar: مراجعة الإجابة

source: Share
ar: يشارك

source: Verify
ar: تحقق

source: Next
ar: التالي

source: Question
ar: السؤال

source: Review Your Answers
ar: راجع إجاباتك

source: No Questions Answered Yet
ar: لم يتم الرد على أي سؤال حتى الآن

source: Correct Answer
ar: الإجابة الصحيحة

source: Your Answer
ar: إجابتك

source: Your answer is correct
ar: إجابتك صحيحة

source: Your answer is wrong
ar: إجابتك خاطئة

source: Moshaf Narration Differences
ar: اختلافات رواية المصحف

source: Show the ten readings
ar: عرض القراءات العشر

# zoom_to_read_text_and_close
source: Use two fingers to further zoom to read text, close this to zoom out
ar: استخدم إصبعين لتكبير النص بشكل أكبر لقراءته، وأغلقه لتصغير
